[
  {
    "title": "Donald J. Trump news - breaking news, video, headlines and ...",
    "url": "https://www.cnn.com/politics/president-donald-trump-47",
    "snippet": "1 day ago ... Donald J. Trump · President Donald Trump speaks to the media after signing executive orders in the Oval Office of · Signage is seen at the United States ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "Video: John Bolton on Trump: 'His favorite is not Russia; his favorite ...",
    "url": "https://www.cnn.com/2025/04/23/politics/video/donald-trump-russia-approach-vladimir-putin-john-bolton-src-digvid",
    "snippet": "14 hours ago ... Former Trump national security adviser John Bolton joins CNN's Kaitlan Collins to weigh in on President Donald Trump's approach to Russia and the ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "'Just contact us': TikToks advertise how to skirt Trump's tariffs | CNN",
    "url": "https://www.cnn.com/2025/04/21/world/video/trump-tariffs-china-warehouses-tiktok-digvid",
    "snippet": "3 days ago ... Chinese suppliers have been flooding American social media, urging users to avoid President Donald Trump's latest tariffs on China by buying directly from ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "Video: Hear from protesters rallying against Trump across the US ...",
    "url": "https://www.cnn.com/2025/04/19/politics/video/anti-trump-protests-hands-off-protesters-musk-digvid",
    "snippet": "5 days ago ... Nationwide protests against President Donald Trump and his administration united an outpouring of protesters across the country. Some were organized as a ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "CNN gets first glimpse of Trump portrait reportedly sent from Putin ...",
    "url": "https://www.cnn.com/2025/04/22/world/video/trump-portrait-russia-putin-ldn-digvid",
    "snippet": "2 days ago ... ... President Trump by Russian President Vladimir Putin. In March, Putin gifted Trump a mystery portrait that was delivered by his envoy Steve Witkoff. CNN ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "China tariffs will 'come down substantially,' Trump says, hinting at ...",
    "url": "https://www.cnn.com/2025/04/22/business/trump-china-trade-war-reduction-hnk-intl/index.html",
    "snippet": "1 day ago ... US President Donald Trump has signaled a major U-turn on his trade war with China, saying the high tariffs on Chinese goods will “come down substantially, ...",
    "source": "cnn.com",
    "content": "US President Donald Trump speaks to reporters in the Oval Office of the White House on April 22, 2025 in Washington, DC. Chip Somodevilla/Getty Images Hong Kong/Washington CNN — US President Donald Trump has signaled a potential U-turn on his trade war with China amid continued market volatility, saying the high tariffs on Chinese goods will “come down substantially, but it won’t be zero.” Trump’s remarks, made at a White House news event Tuesday, appear to mark a rhetorical climbdown after weeks of tough posturing and tit-for-tat retaliation that sent tariffs on China beyond a staggering 145%. “145% is very high and it won’t be that high,” Trump said in a question-and-answer session with reporters in the Oval Office. “It won’t be anywhere near that high. It’ll come down substantially. But it won’t be zero.” Trump made the comments when asked about Treasury Secretary Scott Bessent’s remarks earlier in the day that the high tariff rates between the United States and China have effectively embargoed trade between the economies. Bessent said at a private investment conference hosted by JP Morgan Chase that the trade war with China is unsustainable and he expects the battle to de-escalate in the very near future, a person familiar with the matter confirmed to CNN. Instead of a hard break or complete decoupling between the United States and China, Bessent told investors that the goal is to have a rebalancing of trade, the source told CNN. That assessment gave a boost to a Wall Street rally that had taken shape earlier on Tuesday, with all three major US stock indexes hitting their highest levels of the day after Bessent’s remarks were made public. Asian stocks also rose on Wednesday, with Hong Kong’s Hang Seng Index leading the regional gains, ending the trading day more than 2% higher. Japan’s Nikkei 225 finished about 2% higher and South Korea’s Kospi closed up 1.5%. Asked about Trump and Bessent’s comments on Wednesday, China’s Foreign Ministry said the US should “stop its threats and coercion, and engage with China on the basis of equality, mutual respect and reciprocity” if it wants to make a deal. Chinese President Xi Jinping, also general secretary of the Communist Party of China Central Committee and chairman of the Central Military Commission, learns about the production process and operation of the JL MAG Rare-Earth Co. Ltd. as well as the development of the rare earth industry in the city of Ganzhou in east China's Jiangxi Province on May 20, 2019. Xie Huanchi/Xinhua News Agency/Getty Images Related article China has a powerful card to play in its fight against Trump’s trade war “Claiming it wants to reach an agreement with China while constantly applying maximum pressure is not the right way to engage with China — and it simply won’t work,” Guo Jiakun, a spokesperson for the ministry, told reporters at a regular news conference. “China’s position on the tariff war initiated by the United States is very clear: We do not want to fight, but we are not afraid to fight. If it’s to fight, we’ll fight till the end. If it’s to talk, our door is wide open,” he added. Trump’s shift in tone also went viral on the Chinese internet. On Wednesday, the hashtag “Trump chickened out” was trending as a top topic on social media platform Weibo, racking up more than 150 million views. The world’s two largest economies have slapped record tariffs on each other in a swiftly escalating fight that has roiled global markets, disrupted supply chains and stoked recession fears. So far, China has struck a defiant tone and refused to back down. Instead, it retaliated by raising tariffs on US goods to 125%, adding more American companies on its export control list and unreliable entity list, and restricting the export of critical minerals used in everything from iPhones to missile systems. Beijing also moved to exert pain on key US industries, restricting the number of Hollywood movies shown in the country and returning at least two Boeing jets intended for use by Chinese airlines to the US. Video Ad Feedback Why Trump’s potential U-turn could give China the upper hand 01:20 - Source: CNN Why Trump’s potential U-turn could give China the upper hand 01:20 ‘Very nice’ Through it all, Trump has insisted that he has a “very good relationship” with Xi Jinping while waiting for the Chinese leader to reach out – and has told his team that the US will not make the first move, CNN reported earlier. Rather than calling Trump to negotiate tariffs, Xi has instead launched a diplomatic charm offensive with other trade partners to push back against US efforts to use the tariff war to isolate China economically. On Tuesday, Trump again expressed his hope for Xi to come to the negotiation table – and promised to “be very nice.” Asked if the US was going to play hardball with China or Xi in order to make a deal, or if officials would mention the Covid-19 pandemic, Trump quickly responded: “No.” “No, no, we’re going to be very nice. They’re going to be very nice, and we’ll see what happens,” the president added. “But ultimately, they have to make a deal, because otherwise they’re not going to be able to deal in the United States, and we want them involved.” “I think we’re going to live together very happily and ideally work together, so I think it’s going to work out very well,” he said. A person familiar with the Chinese government’s thinking told CNN last week that before Trump unveiled his “Liberation Day” tariffs on April 2, China had designated a point person for talks with the US, and that Beijing was unclear about the right contact on the US side. Trump may want to be his own negotiator, but this isn’t compatible with how China works, the source added. Referencing hawkish or even hostile views on China expressed by Trump’s Cabinet members, the person said Trump’s failure to reject such views suggested he condoned them despite his public assertions about respecting and liking Xi. Earlier this month, Beijing slammed US Vice President JD Vance for his comments about “Chinese peasants” in an interview that has drawn widespread ire and ridicule on China’s internet. This story has been updated with additional reporting and context."
  },
  {
    "title": "Trump was warned of empty shelves and financial turmoil from tariffs ...",
    "url": "https://www.cnn.com/2025/04/23/business/stock-market-dow-jerome-powell-fed-trump/index.html",
    "snippet": "19 hours ago ... President Donald Trump's unprecedented tariffs, particularly on China, and recent attacks on Federal Reserve Chair Jerome Powell caused alarm among some of ...",
    "source": "cnn.com",
    "content": "Federal Reserve Chair Jerome Powell has said repeatedly the central bank will only make a decision to raise or lower rates after careful consideration. Erin Hooley/AP CNN — President Donald Trump’s unprecedented tariffs, particularly on China, and recent attacks on Federal Reserve Chair Jerome Powell caused alarm among some of his top advisers and America’s biggest CEOs, who warned of financial chaos and store shelves that could go bare, people familiar with the conversations said. The warnings — and the markets’ own volatility this week — seemed to have broken through. Trump backed down Tuesday from his threats to try to remove Powell from the job, telling reporters in the Oval Office: “ I have no intention of firing him.” That prompted sighs of relief on Wall Street. A day after markets boomed on comments from Treasury Secretary Scott Bessent that Trump would seek to de-escalate the trade war with China, US markets gained again on Wednesday. Top administration officials were also relieved by Trump’s Oval Office statement on Powell, the people familiar with the matter said. The officials had become unnerved by the heated rhetoric and wary of a prolonged legal battle should Trump attempt to unseat the Fed chair. The Dow closed higher by 420 points, or 1.07%. The broader S&P 500 gained 1.67% and the tech-heavy Nasdaq Composite rose 2.5%. The three major indexes held on to a rally but finished well below their highest levels of the day. The Dow surged nearly 1,200 points in the morning before pulling back: Stocks came off their highest levels after Bessent cautioned that it could take considerable time to rebalance trade between the United States and China. Video Ad Feedback Treasury secretary: China needs to change 01:17 - Source: CNN Treasury secretary: China needs to change 01:17 There is a “2 to 3-year timeline for the full rebalancing,” Bessent told a group of reporters on Wednesday after delivering a speech at an event hosted by the Institute of International Finance, a person familiar with the matter confirmed to CNN. The comments, previously reported by Bloomberg News and CNBC, underscore how obstacles remain even as investors are eager for trade agreements and CEOs seek clarity on tariffs. White House press secretary Karoline Leavitt on Wednesday said on Fox News there will be “no unilateral reduction in tariffs against China.” “The president has made it clear China needs to make a deal with the United States of America, and we are optimistic that will happen,” Leavitt said. “And when that continues, it will be up to the president what the tariff rate on China will be.” Trump on Wednesday told reporters that his administration will get a “fair deal” with China on trade, adding more broadly that negotiations with countries “are going very well.” When Trump was asked in an impromptu gaggle outside the White House if he was talking to China actively, he responded: “Actively. Everything’s active.” Video Ad Feedback Why Trump’s potential U-turn could give China the upper hand 01:20 - Source: CNN Why Trump’s potential U-turn could give China the upper hand 01:20 “Every country wants to partake, even countries that have ripped us off for many, many years. China is an example, but it’s not just China, European Union. They ripped us off for many, many years, and those days are over,” he added. US Treasury bonds initially rallied Wednesday before giving back those gains in a stark reversal. The benchmark 10-year yield fellow below 4.3% in the morning before rising back up to almost 4.39%, just below where it had settled Tuesday. Yields and prices trade in opposite directions. Trump shifts tone after meeting with CEOs Trump’s notable shift in tone toward Powell and China came a day after he met privately in the Oval Office with chief executives of four major US retail companies who conveyed concerns about rising economic fallout from Trump’s tariff policy and the uncertainty it has created for financial markets. The CEOs of Walmart, Target, Home Depot and Lowe’s, all of whom delivered a blunt message about interruptions in the supply chain and its effects on consumers, were invited to the White House as part of an ongoing internal campaign to make the case to Trump about the real-world impact of his policies, administration officials said. TOPSHOT - US President Donald Trump delivers remarks on reciprocal tariffs during an event in the Rose Garden entitled \"Make America Wealthy Again\" at the White House in Washington, DC, on April 2, 2025. Trump geared up to unveil sweeping new \"Liberation Day\" tariffs in a move that threatens to ignite a devastating global trade war. Key US trading partners including the European Union and Britain said they were preparing their responses to Trump's escalation, as nervous markets fell in Europe and America. (Photo by Brendan SMIALOWSKI / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images) Brendan Smialowki/AFP/Getty Images/File Related article Trump can’t make up his mind about why he’s doing tariffs Trump’s tariffs have placed significant pressure on the retail sector. The business leaders warned that store shelves across America could “soon be empty,” two people familiar with the meeting said, as they presented a dire economic picture that could come into sharper view within weeks. For weeks, White House chief of staff Susie Wiles and other senior advisers have been fielding alarming calls from business leaders about the fallout from Trump’s tariff policies and his ongoing threats to fire the chairman of the Federal Reserve. Taken together, the president’s words have rattled markets and shaken confidence in the administration’s stewardship of the economy. Bessent, who has emerged as one of the leading Cabinet officials whose words have calmed financial markets, played a key role in arranging the meeting of CEOs, officials said, as part of an effort to show Trump how serious the economic challenges facing the administration have become. Doug McMillon, the CEO of Walmart who has developed a cordial relationship with Trump through meetings at Mar-a-Lago and several mutual friends, bluntly told Trump that the trade war with China had already started to disrupt the supply chain, officials said, and would only intensify by summer. Axios first reported the fallout from the president’s meeting with CEOs. Bessent urges caution on Powell Many Trump advisers did not ultimately believe the president would attempt to fire Powell, given the warnings he’d been receiving from his economic team — including Bessent — stretching back several months. And Trump had seemed to absorb the notes of caution. But his amped-up rhetoric over the past week had caused fresh uncertainty about his intentions — in particular, his message on social media Thursday that Powell’s “ termination cannot come fast enough! ” and his follow-up Monday calling Powell a “major loser.” Federal Reserve Chair Jerome Powell delivers remarks at a news conference on March 19, 2025, in Washington, DC. Kevin Dietsch/Getty Images Related article Trump says he has ‘no intention of firing’ Fed Chair Powell, days after saying his ‘termination cannot come fast enough’ Trump has argued that the Fed should cut rates soon to speed up the economy, perhaps as a way to counteract the significant economic drag that his massive tariffs are expected to create. But Powell has said repeatedly the Fed will only make a decision to raise or lower rates after careful consideration and would not rush a decision or issue an emergency rate cut before the rate-setting committee’s next scheduled meeting in May. White House press secretary Karoline Leavitt continued Trump’s line of attack Tuesday in a press briefing, in which she defended the president for criticizing the Fed. She suggested that the Fed’s action to lower rates in the late stages of the Biden administration — but not (yet) under Trump — could be political. There is no evidence the independent Fed is taking a political stance, and Powell has vehemently and repeatedly denied suggestions that the Fed plays politics when making its monetary policy decisions. “The president believes they have been making moves and taking action in the name of politics rather than the name of what’s right for the American economy,” Leavitt said prior to Trump’s Oval Office comments. “The president has the right to express his displeasure with the Fed and he has the right to say he believes interest rates should be lower.” Trump’s top economic adviser Kevin Hassett also told reporters the White House was studying whether Trump could fire Powell, and said a potential “new legal analysis” might ease market concerns. That represented a break from Hassett’s prior comments in support of the central bank’s independence. Leavitt said Tuesday that Hassett had recently changed his mind on the Fed after Powell insisted the central bank wouldn’t rush a decision to cut rates. “I also spoke to Kevin Hassett about the Fed as well and he has called into question the Fed’s independence and whether they are actually doing things out of the best interest of the economy or are they doing it for partisan reasons,” she said. But White House officials had long determined that firing Powell would spark legal challenges and market tumult. And if any study was actually underway, Trump suggested Tuesday it wasn’t necessary. He said in the Oval Office he “never did” have any intention of removing Powell from the job. This story has been updated with additional reporting. CNN’s John Towfighi, Elisabeth Buchwald, Matt Egan and Kit Maher contributed reporting."
  },
  {
    "title": "Trump goes after Federal Reserve's Powell again | CNN Business",
    "url": "https://www.cnn.com/2025/04/23/business/trump-jerome-powell/index.html",
    "snippet": "16 hours ago ... President Donald Trump said Wednesday that Federal Reserve Chair Jerome Powell has kept interest rates too high and that he might call the central bank ...",
    "source": "cnn.com",
    "content": "Jerome Powell, chairman of the US Federal Reserve, in Arlington, Virginia, on April 4, 2025. Tierney L. Cross/Bloomberg/Getty Images CNN — President Donald Trump said Wednesday that Federal Reserve Chair Jerome Powell has kept interest rates too high and that he might call the central bank chief. “I haven’t called him. I might call him,” Trump said in an Oval Office executive action signing ceremony Wednesday evening. “I believe he’s making a mistake by not lowering interest rates, and I think, as well as we’re doing, we could do much better.” Trump has publicly attacked Powell over the past several days, calling the Fed chair “a major loser” whose “termination cannot come soon enough.” Trump nominated Powell to his role in 2017 but has since publicly feuded with him. But he softened his stance Tuesday, saying he had “ no intention ” of firing Powell after advisers warned Trump that terminating the central bank chief would backfire legally and economically, sources familiar with the matter told CNN . But Trump renewed his line of attack on Powell on Wednesday, accusing him of playing politics with interest rate cuts. “He’s keeping rates too high,” Trump said, as also he criticized Powell for acting too slowly to raise rates several years ago in the early days of the inflation crisis. “He historically has been late… he was recommended by a certain person I’m not particularly happy with.” Kevin Warsh, a former governor of the Federal Reserve, during The Semafor World Economy Summit in Washington, DC, on April 18, 2024. Samuel Corum/Bloomberg/Getty Images Related article Trump wants Powell out of the Fed. Waiting in the wings is Kevin Warsh Trump and other White House officials have suggested that the Fed’s action to lower rates in the late stages of the Biden administration — but not (yet) under Trump — could be political. There is no evidence the independent Fed is taking a political stance, and Powell has vehemently denied suggestions that the Fed plays politics when making its monetary policy decisions. Powell has said repeatedly the Fed will only make a decision to raise or lower rates after careful consideration and will not rush a decision or issue an emergency rate cut before the rate-setting committee’s next scheduled meeting in May. “He will hopefully do the right thing – the right thing is to lower interest rates, so we’ll see what happens,” Trump said. “I think we’re we’re sitting on something that’s going to be very good with all the tariff money starting to come in. Our country is going to be doing really well, and hopefully he’ll, you know, we don’t have inflation.” This story has been updated."
  },
  {
    "title": "'Fundamentally destabilizing': The Economist's executive editor on ...",
    "url": "https://www.cnn.com/2025/04/17/business/video/the-economist-donald-trump-jerome-powell-nn-digvid",
    "snippet": "7 days ago ... Charlotte Howard, The Economist's executive editor, weighs in on President Donald Trump's storm of attacks on Federal Reserve Chair Jerome Powell.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "How Trump's presidency can be a colossal failure and stunning ...",
    "url": "https://www.cnn.com/2025/04/23/politics/trump-presidency-chaos-success-analysis/index.html",
    "snippet": "1 day ago ... US President Donald Trump raises a fist as he steps off Air Force One in West Palm Beach, Florida, on April 11. Mandel Ngan/AFP/Getty Images. CNN —. By ...",
    "source": "cnn.com",
    "content": "US President Donald Trump raises a fist as he steps off Air Force One in West Palm Beach, Florida, on April 11. Mandel Ngan/AFP/Getty Images CNN — By conventional measures, Donald Trump’s second presidency is already descending into disarray amid a legal morass, self-inflicted errors, and a vast gap between its massive ambition and its capacity to enact that vision. Yet Trump’s tens of millions of supporters didn’t send a conventional president back to the White House – and don’t judge their hero’s performance by traditional yardsticks. On one hand, exhausting crises on multiple fronts point to a potentially failed administration. But as Trump attempts to destroy governing structures at home and abroad, chaos is itself a marker of success. So the question, as Trump transitions from the shock-and-awe euphoria start of his second term to grinding out his priorities, becomes what kind of event could cause these two competing realities to collide. A recession that the president seems determined to talk the country into might puncture the bubble of achievement that the White House aggressively cultivates each day. High prices and job losses, after all, don’t discriminate between Republican and Democratic voters. Or perhaps it would take a national security crisis precipitated by his volatile leadership and callow foreign policy team to destroy Trump’s presidency. Even then, Trump’s hold on his supporters is so strong, nothing might shake their confidence even if he alienates the middle-ground voters who helped reelect him. This, after all, is a president who convinced millions that the fair election he lost in 2020 was a stitch-up. US President Donald Trump looks on as he hosts the annual Easter Egg Roll on the South Lawn of the White House on April 21, 2025, in Washington, DC. According to the US National Park Service, the egg roll tradition dates back to 1878 when President Rutherford B. Hayes invited children to roll Easter eggs on the White House grounds. Children previously rolled eggs down a hill at the US Capitol in the early 1870s, but a law was passed in 1876 forbidding the Capitol property from being used due to the toll on the lawn. (Photo by Brendan SMIALOWSKI / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images) Brendan Smialowski/AFP/Getty Images Related article In Trump 2.0, the mistakes are multiplying Still, if Trump somehow manages to secure a better deal for US manufacturers with his tariff wars, he might justify the mayhem he’s visited on financial markets. If “America first” really does convince Europe to defend itself and the president’s vows to forge peace work, the world may end up safer. But hubris is threatening an administration that has made overreaches by previous presidents seem tame by comparison. “You were overwhelmingly elected by the biggest majority … Americans want you to be president,” Attorney General Pam Bondi gushed to Trump last week during a Cabinet meeting, suggesting the Trump team has misread its supposed mandate. Trump’s victory, while clear, was not a landslide. Together with a tiny GOP majority in the House, it’s a thin political platform on which to base an attempt to simultaneously remake the global geopolitical system and the world trading paradigm; to transform the US government; and to destroy elite establishment centers of power. Weeks ago, the Washington narrative was that Trump’s second-term team would be more disciplined and unified than his first. But that’s looking increasingly threadbare. The president badly needs some swift wins – not just those that reward his MAGA base – to sustain his credibility. Chaos grows the longer Trump is in power A sense of disorder is mounting. — Backbiting and organizational chaos at the Pentagon came after Defense Secretary Pete Hegseth confirmed fears about his fitness for the job by posting details of military strikes in Yemen on two Signal chats. Rep. Raja Krishnamoorthi speaks during a House Intelligence Committee hearing on Capitol Hill in Washington, DC, on March 26. Demetrius Freeman/The Washington Post/Getty Images — Trump’s trade wars have wiped trillions off global stock markets and are likely soon to hike prices for inflation-weary US shoppers. His threats against Federal Reserve Chairman Jerome Powell have shattered investor confidence. The Dow Jones Industrial Average is heading to its worst April since the Great Depression. And amazingly, the world is wondering whether the dollar is a haven anymore. All of this may be behind an apparent and emerging climbdown that the administration signaled on Tuesday on the China tariffs and Trump’s warnings that he might fire the central bank chief. — His purge of first-term officials who knew how Washington worked is resulting in embarrassing accidents.  An undocumented migrant from Maryland was deported by mistake to El Salvador, igniting a massive legal showdown. And the administration set off a feud with Harvard University , apparently by mistake. — Trump’s claims that the force of his personality alone would end wars made him look foolish. His Ukraine peace effort looks amateur. Carnage is still raging in Gaza. He’s destroyed America’s closest diplomatic friendship, with Canada , with unhinged demands it become the 51st state. His bullying means many tourists are staying away , frightened by potential harassment at US borders. Allies are making alternative arrangements, thereby diminishing American power. — There has been no blizzard of lawmaking to bolster Trump’s claims he’s had the most successful first 100 days in generations. How Republicans will pass his huge tax plan is unclear. And a future Democratic president could wipe out his multitudes of executive orders with a stroke of their own pen. — Tax season at the Internal Revenue Service was marked by dysfunction , with a revolving door of acting commissioners at the key agency. — Elon Musk’s evisceration of the US government may be setting up a series of disasters that are not yet evident. Massive funding cuts may gut US emergency preparedness as hurricane season approaches. Canceled health research on diseases like cancer may cause unnecessary deaths in years to come. The mistaken firing and hurried rehiring of technicians who look after nuclear weapons seems like an emblem of the Tesla chief’s tenure in Washington, which he said on Tuesday he’d soon begin to scale back . — And Trump’s incessant demands for more power have pushed the United States to the brink of one of the worst constitutional crises in 250 years. The forest of legal challenges has also severely disrupted many of the administration’s top priorities, including its signature mass deportation program. A different world The White House, however, insists that such damning assessments do not recognize what it regards as a spectacular record of success. And while Trump world’s creation of alternative facts has reached stunning new heights in his second term, there is some logic to their arguments. The president has never made much pretense of governing for the entire country. His presidencies have been a long succession of attempts to gratify his political base. That lens is the best way to understand his second term. Musk’s Department of Government Efficiency is the culmination of decades of conservative hopes to dismantle the mighty federal machine. This is not just an ideological goal, although hostility to government is one of the few common themes of two great GOP codes, Reaganism and Trumpism. Many Republican officials believe that the civil service has always been a liberal check on their presidents’ power. And if attempts to shatter that stranglehold don’t ultimately result in the full dismantling of what Trump first-term political guru Steve Bannon calls the administrative state, then paralyzing government might work almost as well. It’s going to be all but impossible for a future Democratic president to quickly rebuild what Musk has destroyed. Trump’s belief in almost absolute presidential power horrifies his critics. But millions of Americans voted for this. He made no secret on the campaign trail of his intention to weaponize presidential power and the Justice Department to pursue his enemies. “It’s good to have a strong man at the head of a country,” Trump reflected during a campaign appearance in early 2024, in remarks that explain his domestic and foreign policies. One of the most controversial aspects of that vision is playing out in the deportations of undocumented migrants to a notorious prison in El Salvador, including that of Kilmar Abrego Garcia. Salvadoran police officers escort alleged members of the Venezuelan gang Tren de Aragua recently deported by the US government to be imprisoned in the Terrorism Confinement Center (CECOT) prison in Tecoluca, El Salvador, on March 16. El Salvador’s Presidency Press Office/Handout/Reuters But the White House loves the fight. It’s failed to prove Abrego Garcia is a terrorist and a gang member. But White House press secretary Karoline Leavitt stoked the fire again on Tuesday. “We were always right. The president was always on the right side of this issue to deport this illegal criminal from our community.” When Trump said last week that he’d like to deport US citizen criminals to El Salvador, he knew his audience. And on this immigration issue, he has some genuine results to show for his efforts. Border crossings are down significantly compared with the days of the Biden administration. Trump’s tariff wars seem insane to Wall Street investors and middle-class Americans who’ve seen their 401(k) plans plummet. But the Trump administration is betting on a different audience – working Americans in rural areas and states devastated by globalization who helped elect him twice. “We shipped countless jobs overseas and, with them, our capacity to make things – from furniture, appliances, and even weapons of war,” Vice President JD Vance said in India on Tuesday. He added: “Many were proud of where they came from: their way of life, the kind of jobs they worked, and the kind of jobs their parents worked before them.” Trump’s America first creed horrifies the foreign policy establishment and threatens to undo generations of US leadership. But those are the same experts who ran the wars in Iraq and Afghanistan and are reviled by Trump’s base. America’s reputation abroad is being slammed by Trump’s dismantling of USAID, genuflection to Russian President Vladimir Putin and abandonment of Africa. But Trump and his supporters care little for allies. He’d rather be feared than liked. A veteran of those early 21st-century wars, Hegseth now runs the Pentagon. His defenestration of senior uniformed officers who advocated diversity might be unfairly wrecking military careers and rocking the leadership of the world’s most lethal military. But the former Fox News anchor has the support of conservative media – one reason Trump is standing by him despite reports of his cavalier attitude to classified information. Leavitt hinted at the strategy behind Hegseth’s selection and retention on Tuesday, saying, “There’s a lot of people in this city who reject monumental change, and I think, frankly, that’s why we’ve seen a smear campaign against the secretary of defense since the moment that President Trump announced his nomination before the United States Senate.” A similar distaste for the establishment also explains Trump’s showdown with Harvard. It might have been mistakenly started, but the clash is exactly the kind of issue the White House seeks – placing Trump on the side of the overwhelming majority of Americans who didn’t attend Ivy League colleges. If Democrats chose to defend these bastions of elitism, so much the better for Trump’s political cause. History will form its own judgments on the second term of Trump. But as the daily pandemonium unfolds, it’s worth remembering that this divisive presidency can look like a dangerous failure to half the country while manifesting as a stunning success to the other half. If America was ever united by a common version of reality, that’s no longer the case. This story has been updated with additional developments."
  },
  {
    "title": "BTCS Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/BTCS",
    "snippet": "Apr 16, 2025 ... BTCS, Inc. engages in the digital currency ecosystem and blockchain technologies. It manages an online marketplace where consumers can purchase merchandise ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "BITF Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/BITF",
    "snippet": "5 days ago ... Bitfarms Ltd. (Canada) engages in the business of mining cryptocurrency. The firm is also involved in the ownership and operation of server farms.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "RIOT Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/RIOT",
    "snippet": "5 days ago ... Riot Platforms, Inc. is a bitcoin mining company, which engages in the provision of special cryptocurrency mining computers. It invests in Verady, ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "HIVE Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/HIVE",
    "snippet": "Apr 15, 2025 ... HIVE Digital Technologies Ltd. engages in building a bridge between the digital currency and blockchain sector and traditional capital markets.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "MSTR Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/MSTR",
    "snippet": "3 hours ago ... Latest MSTR news. TipRanks. Press releases. Yesterday 1:03pm ET Michael Saylor Declares New SEC Chair Paul Atkins 'Is Good for Bitcoin' by TipRanks Yesterday 8 ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "Stock Market Data - US Markets, World Markets, and Stock Quotes ...",
    "url": "https://www.cnn.com/markets",
    "snippet": "6 hours ago ... Up-to-date stock market data coverage from CNN. Get the latest updates on US markets, world markets, stock quotes, crypto, commodities and currencies.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "BTDR Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/BTDR",
    "snippet": "Apr 16, 2025 ... Bitdeer Technologies Group engages in the cryptocurrency mining industry. It generates income through its proprietary mining datacenters.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "Pre-market Stock Trading | CNN",
    "url": "https://www.cnn.com/markets/premarkets",
    "snippet": "1 day ago ... ... Nasdaq, NYSE, and NYSE American. Cryptos. Price Change. Nasdaq Crypto Index. 4,348.44. - 73.83. 1.67%. Bitcoin. 92,215.00. - 1,404.00. 1.50%. Ether. 1,755.40. - ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "DJT Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/DJT",
    "snippet": "3 days ago ... ... Crypto.com for ETFs Launch by TipRanks Apr 22, 2025 8:05am ET Trump Media, Crypto.com, Yorkville finalize agreement for ETF launch by TipRanks Apr 21 ...",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "CIFR Stock Quote Price and Forecast | CNN",
    "url": "https://www.cnn.com/markets/stocks/CIFR",
    "snippet": "Apr 14, 2025 ... Cipher Mining, Inc. operates as a Bitcoin mining ecosystem in the United States. The firm is developing a cryptocurrency business.",
    "source": "cnn.com",
    "content": "Content not found"
  },
  {
    "title": "Trump exempts smartphones and computers from new tariffs",
    "url": "https://www.bbc.com/news/articles/c20xn626y81o",
    "snippet": "Apr 12, 2025 ... US President Donald Trump's administration has exempted smartphones, computers and some other electronic devices from \"reciprocal\" tariffs, including the ...",
    "source": "bbc.com",
    "content": "Trump exempts smartphones and computers from new tariffs 13 April 2025 Share Save Madeline Halpert BBC News, New York Share Save Reuters US President Donald Trump's administration has exempted smartphones, computers and some other electronic devices from \"reciprocal\" tariffs, including the 125% levies imposed on Chinese imports. In a notice, US Customs and Border Patrol said that the goods would be excluded from Trump's 10% global tariff on most countries and the much larger Chinese import tax. It marks the first significant reprieve of any kind in Trump's tariffs on China, with one trade analyst describing it as a \"game-changer scenario\". Late on Saturday, while travelling to Miami, Trump said he would give more details of the exemptions at the start of next week. \"We'll be very specific,\" he told reporters on Air Force One. \"But we're taking in a lot of money. As a country we're taking in a lot of money.\" The move came after concerns from US tech companies that the price of gadgets could skyrocket, as many of them are made in China. Exemptions - backdated to 5 April - also include other electronic devices and components, including semiconductors, solar cells and memory cards. \"This is the dream scenario for tech investors,\" Dan Ives, who is the global head of technology research at Wedbush Securities,  posted on X. \"Smartphones, chips being excluded is a game-changer scenario when it comes to China tariffs.\" Big tech firms such as Apple, Nvidia, Microsoft and the broader tech industry can breathe a huge sigh of relief this weekend, he added. The White House indicated the exemptions were made to ensure companies had more time to move production to the US. Why Trump is hitting China on trade - and what might happen next Was Trump's 90-day tariffs pause really a grand plan? \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" White House Press Secretary Karoline Leavitt said in a statement. \"At the direction of the president, these companies are hustling to onshore their manufacturing in the United States as soon as possible.\" Trump, who is spending the weekend at his Florida home, told reporters on Friday he was comfortable with the high tariffs on China. \"And I think something positive is going to come out of that,\" he said, touting his relationship with Chinese President Xi Jinping. These electronic goods are still subject to the 20% tariff on China related to fentanyl, White House Deputy Chief of Staff on Policy Stephen Miller posted on X. Some estimates suggested iPhone prices in the US could have as much as tripled if costs were passed on to consumers. The US is a major market for iPhones, while Apple accounted for more than half of its smartphones sales last year, according to Counterpoint Research. It says as much as 80% of Apple's iPhones intended for US sale are made in China, with the remaining 20% made in India. Like its fellow smartphone giant Samsung, Apple has been trying to diversify its supply chains to avoid an over-reliance on China in recent years. India and Vietnam emerged as frontrunners for additional manufacturing hubs. As the tariffs took effect, Apple reportedly looked to speed up and increase its production of India-produced devices in recent days. Trump had planned for a host of steep tariffs on countries around the world to take effect this week. But on Wednesday he announced he would implement a 90-day pause for countries hit by higher US tariffs - except China, whose tariffs he raised to 145%. Trump said the tariff increase for China was because of the country's readiness to retaliate with its own 84% levy on US goods. In a dramatic change of policy, Trump said all countries that had not retaliated against US tariffs would receive the reprieve – and only face a blanket tariff of 10% – until July. The White House then said the move was a negotiating tactic to extract more favourable trade terms from other countries. Trump has said his import taxes will address unfairness in the global trading system, as well as bring jobs and factories back to the US. Will iPhones cost more because of Trump's tariffs on China? US coffee shops worried about bitter price hike after tariffs 'I can't keep up' - Trump's changing tariffs leave shoppers feeling paralysed Trump tariffs China Trade war Donald Trump United States"
  },
  {
    "title": "Trump threatens Harvard's tax-exempt status after freezing $2bn ...",
    "url": "https://www.bbc.com/news/articles/cz01y9gkdm3o",
    "snippet": "Apr 15, 2025 ... President Donald Trump has called for Harvard University to lose a valuable tax break, hours after his administration announced it is freezing more than ...",
    "source": "bbc.com",
    "content": "Trump threatens Harvard's tax-exempt status after freezing $2bn funding 15 April 2025 Share Save Brandon Drenon BBC News, Washington DC Share Save Getty Images Protesters had called for the university to reject demands from the White House President Donald Trump has called for Harvard University to lose a valuable tax break, hours after his administration announced it is freezing more than $2bn (£1.5bn) in federal funds for the elite institution. The White House has demanded the oldest university in the US make changes to hiring, admissions and teaching practices which it says will help fight antisemitism on campus. Since returning to office, Trump has pushed to reshape top universities by threatening to withhold federal funds that are mostly designated for research. Harvard became the first major US university to reject his administration's demands on Monday, accusing the White House of trying to \"control\" its community. In a Tuesday morning post on social media, Trump threatened to go beyond withholding the federal funds and targeted Harvard tax-exempt status. Universities, as well as many charities and religious groups, are exempt from paying federal income taxes. This valuable tax break, though, can be removed if the groups become involved in political activities or move away from their stated purposes. \"Perhaps Harvard should lose its Tax Exempt Status and be Taxed as a Political Entity if it keeps pushing political, ideological, and terrorist inspired/supporting \"Sickness?\" he wrote on Truth Social. \"Remember, Tax Exempt Status is totally contingent on acting in the PUBLIC INTEREST!\" Watch: 'It's not right' - Students react to Trump freezing Harvard's federal funding Losing the exemption could cost Harvard millions of dollars each year. The Ivy League institution also has a fund of assets, or endowment, valued at $53bn. Later on Tuesday, White House Press Secretary Karoline Leavitt said Trump wanted the university to apologise for what his administration says is continuing tolerance of antisemitism. \"[Trump] wants to see Harvard apologise, and Harvard should apologise,\" Leavitt said. Watch: White House says Harvard should apologise to Jewish students The sweeping changes demanded by the White House would have transformed Harvard's operations and ceded a large amount of control to the government. Its letter to Harvard on Friday, obtained by the New York Times, said the university had failed to live up to the \"intellectual and civil rights conditions\" that justify federal investment. The letter included 10 categories for proposed changes, including: reporting students to the federal government who are \"hostile\" to American values ensuring each academic department is \"viewpoint diverse\" hiring an external government-approved party to audit programmes and departments \"that most fuel antisemitic harassment\" checking faculty staff for plagiarism President Trump has accused leading universities of failing to protect Jewish students when college campuses around the country saw protests against the war in Gaza and US support for Israel last year. The letter orders the university to take disciplinary action for \"violations\" during protests. In explaining its rejection of these demands, Harvard president Alan Garber said the university would not surrender its independence or relinquish its constitutional rights under the First Amendment protecting free speech. \"Although some of the demands outlined by the government are aimed at combating antisemitism, the majority represent direct governmental regulation of the 'intellectual conditions' at Harvard,\" he said. Columbia University agrees to Trump demand for mask ban Trump pulls $400m from Columbia University Why has Trump revoked hundreds of international student visas? Shortly after his letter of resistance was sent, the education department said it was freezing $2.2bn in grants and $60m in contracts to Harvard immediately. \"Harvard's statement today reinforces the troubling entitlement mindset that is endemic in our nation's most prestigious universities and colleges,\" the Department of Education said in a statement. The disruption of learning plaguing campuses is unacceptable and the harassment of Jewish students intolerable, the statement said. A professor of history at Harvard, David Armitage, told the BBC that the school could afford to resist as the richest university in the US and no price was too high to pay for freedom. \"It's a not unexpected act of entirely groundless and vengeful activity by the Trump administration which wants nothing more than to silence freedom of speech,\" he said. In March, the Trump administration said it was reviewing roughly $256m in federal contracts and grants at Harvard, and an additional $8.7bn in multi-year grant commitments. Congresswoman Elise Stefanik, a Republican from New York, said on X: \"It is time to totally cut off US taxpayer funding to this institution.\" Harvard professors filed a lawsuit in response, alleging the government was unlawfully attacking freedom of speech and academic freedom. Harvard is one of a number of elite universities in the crosshairs of the new presidency. Columbia University in New York City agreed to a number of demands last month after the White House pulled $400m in federal funding. But on Monday Columbia struck a less compliant tone, releasing its own letter that said it was continuing \"good faith talks\" with the government as it seeks to win back its funding, but also said it would \"reject any agreement that would require us to relinquish our independence\". Polling by Gallup last summer suggested that confidence in higher education has been falling over time among Americans of all political backgrounds, partly driven by a growing belief that universities push a political agenda. The decline was particularly steep among Republicans. Watch: Moment Columbia student Mohsen Mahdawi arrested by ICE Earlier on Monday, a lawyer for an organiser of pro-Palestinian protests at Columbia University said her client had been arrested by immigration officials as he attended an interview as part of his application for US citizenship. Mohsen Mahdawi, a green card holder who is due to graduate next month, was detained on Monday in Colchester, Vermont. Others who took part in campus protests against the war, including Columbia University's Mahmoud Khalil and Tufts University's Rumeysa Ozturk, have been detained in recent weeks. Israel-Gaza war United States Massachusetts"
  },
  {
    "title": "Trump hints at softening China tariffs and says no plan to sack Fed ...",
    "url": "https://www.bbc.com/news/articles/c86jyw5jp6go",
    "snippet": "1 day ago ... ... Trump's tariffs on the economy. US President Donald Trump has appeared to soften his recent comments on China and the head of the US Federal Reserve after ...",
    "source": "bbc.com",
    "content": "Trump hints at softening China tariffs and says no plan to sack Fed boss 1 day ago Share Save João da Silva Business reporter, BBC News Share Save Watch: 'It will be expensive' - Americans react to the impact of Trump's tariffs on the economy US President Donald Trump has appeared to soften his recent comments on China and the head of the US Federal Reserve after recent clashes as he pursues his economic agenda. Trump said he has \"no intention of firing\" Jerome Powell after repeatedly criticising the head of the central bank, but added that he would like Powell to be \"a little more active\" on cutting interest rates. Speaking in the Oval Office on Tuesday, Trump also said he was optimistic about improving trade relations with China. He said the level of tariffs - or import taxes - that he had imposed on Chinese imports would \"come down substantially, but it won't be zero\". The president's tariffs are an effort to encourage factories and jobs to return to the US. This is a pillar of his economic agenda - as is a cut in interest rates, aimed at reducing the cost of borrowing for Americans. Trump has ratcheted the rate on Chinese goods up to 145% - sparking reciprocal measures from Beijing and warnings from economists about the global impact of a trade war. In his comments to reporters on Tuesday, Trump said he would be \"very nice\" in negotiations with Beijing - in the hope of securing a trade deal. Watch: Trump says US is actively negotiating a 'fair' tariffs deal with China Earlier, US Treasury Secretary Scott Bessent reportedly said he expected a de-escalation of the trade war, which he said was unsustainable. Responding to comments from China, he said the current situation was \"not a joke\". The trade war has led to turbulence in financial markets around the world - to which Trump's comments on Powell have also contributed. The Fed has not cut rates so far this year, after lowering them by a percentage point late last year, a stance Trump has heavily criticised. Last week, the president intensified his attacks on the Fed chief, calling him \"a major loser\". The comments sparked a selloff of stocks, bonds and the US dollar - though markets have since been recovering from those losses. National Economic Council Director Kevin Hassett said on Friday that Trump was looking into whether it would be possible to sack Powell - who he first nominated to lead the central bank in 2017. Powell was then renewed in 2021 by Joe Biden. It is unclear whether Trump has the authority to fire the Fed chair. No other US president has tried to do so. Why should I care if the US dollar falls? US sets tariffs of up to 3,521% on South East Asia solar panels Most major Asian stock markets were higher on Wednesday as investors appeared to welcome the latest remarks. Japan's Nikkei 225 index rose about 1.9%, the Hang Seng in Hong Kong climbed by around 2.2%, while mainland China's Shanghai Composite was down less than 0.1%. That came after US shares made gains on Tuesday, with the S&P 500 ending Tuesday's session up 2.5% and the Nasdaq rose 2.7%. US futures were also trading higher overnight. Futures markets give an indication of how financial markets will perform when they open for trading. Investors feared that pressure on Powell to lower interest rates could cause prices to rise at a time when trade tariffs are already seen boosting inflation. Trade tensions between the world's biggest economies, as well as US tariffs on other countries around the world, have triggered uncertainty about the global economy. Those concerns triggered turmoil in financial markets in recent weeks. On Tuesday, the forecast for US economic growth for this year was given the biggest downgrade among advanced economies by the International Monetary Fund (IMF) due to uncertainty caused by tariffs. The sharp increase in tariffs and uncertainty will lead to a \"significant slowdown\" in global growth, the Fund predicted. Trump has imposed taxes of up to 145% on imports from China. Other countries are now facing a blanket US tariff of 10% until July. His administration said last week that when the new tariffs are added on to existing ones, the levies on some Chinese goods could reach 245%. China has hit back with a 125% tax on products from the US and vowed to \"fight to the end\". The Chinese government has not yet officially responded to the latest statements from the Trump administration. However, an article in the state-controlled Global Times on Wednesday quoted commentators who said the remarks showed that the US is beginning to realise the tariffs do more harm than good to America's economy. International Business US Federal Reserve Jerome Powell Donald Trump"
  },
  {
    "title": "Insurrection Act 1807: What is the rarely-used law Trump wants to ...",
    "url": "https://www.bbc.com/news/articles/c9qwez9zz7jo",
    "snippet": "3 days ago ... The Insurrection Act of 1807 allows the president to deploy the military to enforce laws on US soil, including arresting migrants.",
    "source": "bbc.com",
    "content": "Could Trump invoke another rarely-used law at the border? 3 days ago Share Save Ana Faguy BBC News, Washington DC Share Save Getty Images On his first day back in the White House, President Donald Trump signed an executive order declaring an emergency at the US southern border and directed his top officials to evaluate whether to invoke a rarely used 19th-century law in response to immigration concerns. The Insurrection Act of 1807 allows the president to use active-duty military personnel to perform law-enforcement duties inside the US. US media report that Defence Secretary Pete Hegseth and Homeland Security chief Kristi Noem, who were tasked with the assessment, will announce their recommendations later this week. Since returning to office, Trump has made cracking down on illegal immigration a central focus, and border crossings have reached a quarter-century low. But the  statute could further expand the president's powers. Here's what to know. What is the Insurrection Act of 1807? The 19th-century law would allow the use of active-duty military personnel to perform law-enforcement duties within the US. This includes the National Guard - a branch of the US armed forces traditionally reserved for domestic emergencies and disasters. US presidents can invoke the law if they determine that \"unlawful obstructions, combinations, or assemblages, or rebellion\" against the government make it \"impracticable to enforce\" US law \"by the ordinary course of judicial proceedings\". Once invoked, troops could be tasked with a range of duties, from quelling civil unrest and enforcing court orders to arresting and detaining migrants. Because the Insurrection Act was written in broad terms, with little specific guidance on how and when the powers can be used, it gives presidents wide latitude in deciding when to mobilise military personnel for domestic operations. Why does Trump want to use it? Throughout his election campaign, Trump vowed to crackdown on illegal immigration, calling the southern border situation a \"national emergency\" that could be better tamed by invoking the 19th-century statute. On his first day in office in January, he asked for \"recommendations regarding additional actions that may be necessary to obtain complete operational control of the southern border, including whether to invoke the Insurrection Act of 1807\". The administration has already rolled out a series of sweeping measures targeting the border. These include a nationwide deportation sweep and the controversial move to transfer alleged Venezuelan gang members to a prison in El Salvador - a decision now facing legal challenges. This comes as US Border Patrol has recorded just 8,300 migrant apprehensions, marking the lowest number of border crossings since 2000. Anxiety at US colleges as foreign students are detained and visas revoked I wanted to study in the US - now I'm too scared I'll get deported Trump to end protected status for Afghans and Cameroonians Watch: President Donald Trump signs first executive orders in arena How has it been used in the past? The Insurrection Act has been invoked a handful of times in American history. Abraham Lincoln used it when the southern states rebelled during the US Civil War, and former President Ulysses S Grant invoked it against a wave of racist violence by the Ku Klux Klan after the war. In the 20th century, former President Dwight D Eisenhower invoked it so the US Army would escort black students into their high school in Little Rock, Arkansas, after the state's governor refused to comply with a federal desegregation order. More recently, it was used in 1992 when massive riots broke out in Los Angeles over the acquittal of four white police officers in the beating of Rodney King, a black man. Then-President George Bush sent in active-duty members of the Marines and Army as well as National Guard troops. Are there any limits on the law? The US government has traditionally worked to limit the use of military force on American soil, especially against its own citizens. The Posse Comitatus Act of 1878 was enacted to restrict the military from acting as domestic law enforcement. In times of unrest, states typically deploy the National Guard to help maintain order. Since returning to office, Trump has expanded his authority by declaring national emergencies - a move that grants the presidency access to powers and resources that are normally restricted. He has used this authority to impose tariffs and, more controversially, to take action on immigration. In March, following his emergency declaration at the border, Trump invoked the rarely used Alien Enemies Act of 1798 to deport migrants he alleged were gang members.  Earlier this month, the Supreme Court temporarily blocked that effort. If Trump chooses to invoke the Insurrection Act, it remains unclear what legal challenges he might face. US immigration Donald Trump United States Detention centres"
  },
  {
    "title": "US stocks and dollar slide after Trump attacks Fed chair Powell",
    "url": "https://www.bbc.com/news/articles/ce92y3j9v34o",
    "snippet": "2 days ago ... The president amps up attack against US central bank boss calling him \"a major loser\" for not lowering interest rates.",
    "source": "bbc.com",
    "content": "US stocks and dollar plunge as Trump attacks Fed chair Powell 2 days ago Share Save Natalie Sherman & Faarea Masud Business reporters, BBC News Share Save Getty Images US stocks and the dollar plunged again as President Donald Trump intensified his attacks on the US central bank boss calling him \"a major loser\" for not lowering interest rates. In a social media post, Trump called on Federal Reserve chair Jerome Powell to cut interest rates \"pre-emptively\" to help boost the economy, saying Powell had been consistently too slow to respond to economic developments. \"There can be a SLOWING of the economy unless Mr. Too Late, a major loser, lowers interest rates, NOW,\" he wrote. Trump's criticism of Powell's handling of the US economy comes as his own plans for tariffs have driven a stock market sell-off and raised fears of economic recession. The president's intensifying clash with Powell, whom he named to lead the Fed during his first term, has added to the market turmoil. Live coverage of this story The S&P 500, which tracks 500 of the biggest US companies, fell roughly 2.4% on Monday. It has lost roughly 12% of its value since the start of the year. The Dow Jones Industrial Average dropped 2.4% and has dropped about 10% so far this year, while the Nasdaq fell more than 2.5% and is down roughly 18% since January. However, on Tuesday, trading on most major stock indexes in the Asia-Pacific region was subdued. Japan's Nikkei 225 closed around 0.1% lower, and the ASX 200 in Sydney closed around 0.3% lower. Hong Kong's Hang Seng closed about 0.3% higher. In European early trading, the UK's FTSE 100 stock exchange was marginally lower by about 0.05%, while Germany's Dax was down around 0.5% and France's CAC was down 0.6%. Though the US dollar and US government bonds are typically considered safe assets in times of market turmoil, they have not escaped the recent turbulence. The dollar index - which measures the strength of the dollar against a set of currencies including the euro - on Monday fell to its lowest level since 2022. Interest rates on US government debt also continued to rise on Tuesday, as investors demanded higher returns for holding Treasuries. Meanwhile, the price of gold hit a new all-time record high, breaking the $3,500 (£2,613) per ounce mark as investors seek out so-called \"safe haven\" assets. The precious metal is viewed as a safer place to put money during times of economic uncertainty. Susannah Streeter, head of money and markets at Hargreaves Lansdown, said as well as tariffs, gold's appeal had also increased due there being \"no long-term resolution in sight for conflicts around the world, particularly in Ukraine and Gaza\". \"There are also concerns about the risk that geo-political tensions escalate as opportunities in the Arctic are eyed by the US and Russia,\" she added. China warns nations against 'appeasing' US in trade deals No global recession despite US tariffs, says IMF Why everyone is suddenly so interested in US bond markets Trump's criticism of Powell dates back to his first term in office, when he also reportedly discussed firing him. Since winning the election, he has urged Powell to lower borrowing costs. The latest criticism follows Powell's warnings that Trump's import taxes were likely to drive up prices and slow the economy. Trump last week called publicly for Powell to be fired , writing on social media on Thursday: \"Powell's termination cannot come fast enough.\" Such a move would be controversial - and legally questionable - given a tradition of independence at the bank. Powell last year told reporters he did not believe the president had the legal authority to remove him. But one of Trump's top economic advisers confirmed that officials were studying the option on Friday, when the stock market in the US was closed for trading. 'When the US sneezed, the world caught a cold' Trump's latest comments come as top economic policymakers are gathering in Washington for the spring meetings of the International Monetary Fund (IMF) and World Bank. Christopher Meissner, a professor of economics at University of California, Davis, and who formerly worked with the IMF, told the BBC's Today programme that before the 1970s there was \"significant\" political pressure on the Federal Reserve from time to time. \"However, the past 30 or 40 years what we've learned is that central bank independence is the key to financial stability and low inflation. And I think this is a major reversal and we have to watch out for it,\" he added. \"The independence of central banks is seen as critical to ensure long-term price stability, ringfencing policymakers from short-term political pressures,\" added Ms Streeter, of Hargreaves Lansdown. The IMF will publish its latest growth forecasts for individual countries later, and last week it said these projections would include \"notable markdowns\" . Mr Meissner said: \"They used to say 'When the US sneezed, the rest of the world caught a cold'. It'll be really curious to see if that continues. \"However, I think people are expecting a pretty significant downturn in the US in the coming months... and that can't be good for the rest of the world.\" Ms Streeter said that Trump's policies had damaged the reputation of the US, which is \"no longer being seen as a calmer port in a storm\". \"Yields on 10–year US Treasuries have held onto their recent rise above 4.4%. It's another sign of unease about the direction of the US economy, amid worries that policies playing out could keep inflation higher and slow growth, and flags the anxiety rattling through the markets right now,\" she added. Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter . Readers in the UK can sign up here . Those outside the UK can sign up here. US economy Jerome Powell Stock markets Donald Trump"
  },
  {
    "title": "What is Doge and why is Musk stepping back?",
    "url": "https://www.bbc.com/news/articles/c23vkd57471o",
    "snippet": "1 day ago ... Democrats accuse them of tampering with funding approved by Congress that is outside the president's scope. The White House denies that the work has broken any ...",
    "source": "bbc.com",
    "content": "What is Doge and why is Musk stepping back? 1 day ago Share Save Jennifer Clarke BBC News Share Save Watch: Musk defends government cuts in surprise White House appearance Tesla boss Elon Musk has pledged to \"significantly\" cut back his role in Doge, the body tasked with reducing US government spending and cutting jobs. The Department of Government Efficiency has faced legal challenges over the scope of its work, and Musk and his team have been been criticised for a lack of transparency. However, polling suggests its cost-cutting agenda has widespread support. What is Doge? Despite its full name, Doge is not an official government department, which can only be established by an act of Congress. Instead the advisory body was created by an executive order signed by US President Donald Trump. Part of Doge's mission, according to the order, relates to IT upgrades aimed at boosting efficiency. It must finish its work by July 2026. Many Doge staff appear to be young people with tech backgrounds and limited or no government experience. Is Elon Musk a government employee? Yes. Musk initially said he would perform his role as an outside volunteer but the White House later confirmed he would operate as an unpaid special government employee. That designation covers those working for the government for no more than 130 days in a year. Supporters argued that the body's outsider status - and somewhat vague mandate - would increase its effectiveness. \"They're a little more untethered to the bureaucracy itself and to the systems that slow processes down around here,\" Republican Senator Kevin Cramer of North Dakota told the BBC. \"I think the lack of parameters is part of what will make them effective.\" In an unexpected appearance at the White House in February, Musk denied leading a \"hostile takeover\" of the US government , and defended his approach. \"The people voted for major government reform and that's what the people are going to get,\" he said. \"That's what democracy is all about.\" He also made a number of exaggerated and unsupported claims during the event. Who is Musk and what is his net worth? 'People seem dumbstruck' - Inside Musk's race to upend government Who is Doge's official leader? White House says it's not Musk What has Elon Musk said about his commitment to Doge? Musk said his \"time allocation to Doge\" would \"drop significantly\" from May to one to two days per week, after accusations he had taken his focus off Tesla. His political involvement has sparked global protests and boycotts against the company's cars. In April, the firm said sales had fallen to their lowest level in three years and warned investors that \"changing political sentiment\" could continue to hurt demand. Musk was already due to reach his 130-day limit on government work in late May, but it is not clear whether he will step down completely. He pledged to stay on \"as long as the president would like me to do so and as long as it's useful\". Musk to reduce Doge role after Tesla profits plunge Inside the rural Texas town where Elon Musk is basing his business empire Getty Images Musk was among the attendees at Trump's inauguration, having donated to the president's re-election campaign What has Doge done? Musk said Doge's mission was to end the \"tyranny of the bureaucracy\", save taxpayers' money and reduce US national debt, which stands at $36tn (£28.9tn). Initially he said he hoped to save as much as $2tn a year, but later tempered this estimate. It is not clear how much money Doge has managed to save so far, although its X account gives regular, celebratory updates about its activities. These have included shuttering government agencies, defunding programmes and mass layoffs: Trump insists Doge representatives have identified \"fraud and abuse\" inside various departments but has not provided evidence to support his claim More than two million government employees have been offered a \"buyout\" deal to leave but some fired staff have been rehired While tackling so-called \"woke\" policies, Musk said his team had \"saved taxpayers over $1bn in crazy DEI [diversity, equity and inclusion] contracts\" The vast majority of programmes run by USAID, America's main foreign aid organisation, have been cut What do Americans think about Doge? Polling in February by the BBC's US partner CBS News suggested that Doge had popular appeal. It indicated that a majority of Americans - especially Republican voters - backed its work. Watch: 'Thank God for Elon Musk' - Maga Republicans praise Doge cuts David Ditch, a senior analyst at the Economic Policy Innovation Center, a conservative think tank, insists Doge's work is necessary: \"They're shining a very bright spotlight on various parts of the federal government and they're asking -  whether it's the American public, whether it's moderate members of the Republican caucus - is this how you want America's tax dollars to be used?\" But even some of those who support Doge's work appear to dislike Musk himself. In February, Pew Research found that 54% of Americans had an unfavourable view of him, including 37% who said their view was \"very unfavourable\". Musk wields his Doge chainsaw - but is a backlash brewing? Americans weigh up Musk's influence What opposition has Doge faced? Political opponents and government watchdogs have criticised Doge for acting without transparency and spreading misinformation about government spending - and accuse Musk of overstepping his authority as an unelected official. They highlight potential conflicts of interest, given Musk's businesses hold contracts with the US government worth billions. Trump and Musk deny that any conflicts have arisen. Democrats accuse them of tampering with funding approved by Congress that is outside the president's scope. The White House denies that the work has broken any laws. Multiple groups including unions and state attorneys general have sued Doge and the wider Trump administration over their plans. On several occasions the courts have stepped in to halt the cost-cutting moves, at least once blocking Doge directly when a judge stopping the agency from accessing personal data held within US Treasury records. Many analysts remain sceptical about whether Doge can deliver on its bold pledges. Elaine Kamark from the Brookings Institution said government spending could be streamlined, highlighting her own work for President Bill Clinton in the 1990s. But she described Musk's goal to slash a third of government spending as \"ridiculous\", since so much of the budget was mandatory, including popular programmes like Social Security and Medicare. Elon Musk US election 2024 Donald Trump"
  },
  {
    "title": "Trump says US will 'pass' on Ukraine peace talks if no progress soon",
    "url": "https://www.bbc.com/news/articles/c20x5xn1g92o",
    "snippet": "6 days ago ... Donald Trump has said the US will \"take a pass\" on brokering further Russia-Ukraine talks if Moscow or Kyiv \"make it very difficult\" to reach a peace deal.",
    "source": "bbc.com",
    "content": "Trump says US will 'pass' on Ukraine peace talks if no progress soon 6 days ago Share Save James Waterhouse Ukraine Correspondent Reporting from Odesa Ruth Comerford BBC News Share Save Watch: Trump says US will 'take a pass' if no progress in Ukraine talks Donald Trump has said the US will \"take a pass\" on brokering further Russia-Ukraine talks if Moscow or Kyiv \"make it very difficult\" to reach a peace deal. The US president told reporters in the Oval Office on Friday that he was not expecting a truce to happen in \"a specific number of days\" but he wanted it done \"quickly\". His comments came hours after US Secretary of State Marco Rubio warned that the US would abandon talks unless there were clear signs of progress within days. \"We're not going to continue with this endeavour for weeks and months on end,\" Rubio said, adding that the US had \"other priorities to focus on\". This comes as Russian strikes on Ukraine continue, with two people reported killed and more than 100 injured in the north-eastern cities of Kharkiv and Sumy on Friday. Moscow launched a full-scale invasion of Ukraine in 2022, and Russian troops have been advancing - albeit slowly - in eastern Ukraine. President Vladimir Putin has placed a number of conditions on any potential ceasefire. Trump's direct diplomacy with Putin and sharp criticism of Ukraine's President Volodymyr Zelensky have raised concern among Nato allies, who argue that support for Kyiv must be maintained. Ukraine minerals deal may not buy peace after Trump threat When asked about a deal between Russia and Ukraine on Friday, Trump said: \"We're talking about here people dying. We're going to get it stopped, ideally. \"Now if, for some reason, one of the two parties makes it very difficult, we're just going to say, 'you're fools, you're horrible people,' and we're going to just take a pass.\" Despite the Trump administration's initial confidence that it could secure a deal quickly, attempts to reach a full ceasefire have yet to materialise, with Washington blaming both sides. Following a meeting with European leaders in Paris about a potential ceasefire on Thursday, Rubio told reporters on Friday: \"We need to determine very quickly now - and I'm talking about a matter of days - whether or not this is doable.\" \"If it's not going to happen, then we're just going to move on,\" he said about truce talks. He admitted that a peace deal would be difficult to strike. Trump had said before he re-entered office that he would stop the fighting in the first 24 hours of his presidency. \"It's not our war\": US Secretary of State Marco Rubio threatens to move on from Ukraine peace talks Kremlin spokesman Dmitry Peskov, when asked to respond to Trump saying he expected an answer from Russia on a ceasefire, said \"the negotiations taking place are quite difficult\". \"The Russian side is striving to reach a peace settlement in this conflict, to ensure its own interests, and is open to dialogue,\" he said. During a meeting with Italian Prime Minister Giorgia Meloni in Rome on Friday, US Vice-President JD Vance said he was still \"optimistic\" about ending the Ukraine war. \"I want to update the prime minister on some of the negotiations between Russia, Ukraine, and also some of the things that have happened even in the past 24 hours,\" he said. \"I won't prejudge them, but we do feel optimistic that we can hopefully bring this war - this very brutal war - to a close.\" EPA Vance's comments followed separate news that Ukraine and the US took the first step towards striking a minerals deal, after an initial agreement was derailed when a February meeting between Trump and President Zelensky erupted into a public shouting match. On Thursday, the two countries signed a memorandum of intent on setting up an investment fund for Ukraine's reconstruction as part of an economic partnership agreement. The aim is to finalise the deal by 26 April, the memo published by the Ukrainian government says. The details of any deal remain unclear. Previous leaks have suggested the agreement has been extended beyond minerals to control of Ukraine's energy infrastructure, as well as its oil and gas. Ukrainian negotiators have tried to resist Trump's demands that a joint investment fund would pay back the US for previous military aid, but have seemingly accepted his claim that it would help the country recover after the war ends. The memo said the \"American people desire to invest alongside the Ukrainian people in a free, sovereign and secure Ukraine\". Zelensky had been hoping to use the deal to secure a US security guarantee in the event of a ceasefire deal, telling European leaders last month that \"a ceasefire without security guarantees is dangerous for Ukraine\". The US has so far resisted providing Kyiv with security guarantees. The White House argues the mere presence of US businesses would put off Russia from further aggression, but that did not exactly work when they invaded in 2022. Reuters A bakery was hit during a recent Russian strike on Sumy Economy Minister Yulia Svyrydenko announced the signing of the memorandum on X , with pictures of Svyrydenko and US Treasury Secretary Scott Bessent separately signing the document over an online call. \"There is a lot to do, but the current pace and significant progress give reason to expect that the document will be very beneficial for both countries,\" Svyrydenko wrote. Bessent said the details were still being worked out but the deal is \"substantially what we'd agreed on previously.\" Trump hinted at the deal during a press conference with Meloni, saying \"we have a minerals deal which I guess is going to be signed on (next) Thursday... and I assume they're going to live up to the deal. So we'll see. But we have a deal on that\". Ivanna Klympush-Tsintsadze, an MP and the chair of Ukraine's parliamentary committee on EU Integration, told the BBC the Ukrainian parliament would have \"the last word\" in the deal. She added: \"I hope that there will be enough reasoning to ensure that whatever is signed, and if it is going to be ratified that it is in the interest of our country and our people\". On Thursday, Ukrainian Foreign Minister Andrii Sybiha met Rubio and Trump's special envoy Steve Witkoff in Paris to discuss how to end the war. Sybiha said they had \"discussed the paths to a fair and lasting peace, including full ceasefire, multinational contingent, and security guarantees for Ukraine\". What minerals does Ukraine have and what are they used for? What we know about US-Ukraine minerals deal Why Trump is struggling to secure fast ceasefire in Ukraine War in Ukraine Donald Trump United States Ukraine"
  },
  {
    "title": "Donald Trump suggests UK state visit set for September",
    "url": "https://www.bbc.com/news/articles/cp8k5n33y41o",
    "snippet": "6 days ago ... EPA US President Donald Trump attends a meeting with the Italian prime minister at the Oval EPA. US President Donald Trump has suggested Buckingham Palace is ...",
    "source": "bbc.com",
    "content": "Trump suggests UK state visit set for September 6 days ago Share Save Thomas Mackintosh BBC News Noor Nanji Culture reporter Share Save EPA US President Donald Trump has suggested Buckingham Palace is \"setting a date for September\" for his second state visit to the UK. The president told reporters in the White House on Thursday evening: \"I was invited by the King and the country - great country.\" It comes after Prime Minister Sir Keir Starmer handed Trump an invitation letter from King Charles in February during his visit to Washington. Palace sources said an invitation has been issued for the visit, and discussions are continuing to find a suitable date and venue, with nothing finalised at this stage. Trump was hosted by the late Queen Elizabeth II during his previous three-day state visit in 2019, which took place during his first term in office. Traditionally, second-term US presidents are not offered a state visit and have instead been invited for tea or lunch with the monarch at Windsor Castle. King Charles' letter proposed a meeting to discuss details of the state visit at either Dumfries House or Balmoral, both in Scotland, a country to which Trump has connections. BBC News understands that any visit from Trump would have to be hosted at Windsor as several Buckingham Palace state rooms are out of action due to reservicing. Trump's mother was born and brought up on the Hebridean island of Lewis. This year he is planning to open a new golf course in Aberdeenshire, to be named after his mother . Speaking on Thursday, Trump said: \"They're going to do a second, as you know, a second fest… that's what it is: a fest, and it's beautiful, and it's the first time it's ever happened to one person. \"And the reason is we have two separate terms, and it's an honour… I'm a friend of Charles, I have great respect for King Charles and the family, William, we have really just a great respect for the family. \"And I think they're setting a date for September.\" King invites Donald Trump for second UK state visit There has been no official confirmation from Downing Street, but if confirmed, the visit will be seen as an important way to strengthen relations with Washington, amid its ongoing trade war. Starmer - who is looking to complete a trade deal with the US and remove recently imposed tariffs on the UK - previously said the invite for the second visit was \"truly historic\" and \"unprecedented\". During the UK prime minister's visit to the White House in February, Trump showed cameras the contents of the King's letter . It read: \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second state visit to the United Kingdom. \"As you will know this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content. \"In so doing, working together, I know we will further enhance the special relationship between our two countries of which we are both so proud.\" Donald Trump United States"
  },
  {
    "title": "Massad Boulos: Africa is important to Trump, US envoy tells BBC",
    "url": "https://www.bbc.com/news/articles/ce82w356lezo",
    "snippet": "1 day ago ... Donald Trump \"highly values Africa and African people\", says his African envoy, Massad Boulos.",
    "source": "bbc.com",
    "content": "Africa is important to Trump, despite aid cuts, envoy tells BBC 1 day ago Share Save Wycliffe Muia and Rob Young BBC News Share Save Reuters Massad Boulos says US tariffs and aid cuts are necessary to ensure transparency US Senior Advisor for Africa Massad Boulos has said that President Donald Trump values Africa, despite announcing sweeping aid cuts that have caused considerable humanitarian distress across the continent. Trump announced the aid freeze on his first day in office in January in line with his \"America First\" foreign policy, while Trump's recent tariffs have raised fears of the end of a trade deal between the US and Africa meant to boost economic growth. But Mr Boulos told BBC's Newsday that Africa was \"very important\" to Trump and downplayed reports that the US was planning to close some of its missions in the continent. \"He highly values Africa and African people,\" Mr Boulos added. The aid cuts have affected health programmes across Africa, including shipments of critical medical supplies, including HIV drugs. US cuts send South Africa's HIV treatment 'off a cliff' How jeans and diamonds pushed Lesotho to the top of Trump's tariffs list Trump's tariffs could be death knell for US-Africa trade pact 'My wife fears sex, I fear death' - impacts of the USAID freeze The majority of the US Agency for International Development's (USAID) programmes, which provided health and humanitarian assistance to vulnerable nations, have since been terminated . Eight countries - six of them in Africa, including Nigeria, Kenya and Lesotho - could soon run out of HIV drugs following the US decision to pause foreign aid, the World Health Organization (WHO) has warned. There are fears that nearly six million more Africans could be pushed into extreme poverty next year following the aid cuts, according to the Institute for Security Studies (ISS) – a pan-African think-tank. Earlier this month, eight people, including five children, died after walking for hours to seek treatment for cholera in South Sudan after aid cuts by the Trump administration forced local health clinics to close, the international charity Save the Children reported. But Mr Boulos said those reported deaths could not be directly linked to the US aid cuts and said they were needed to ensure the money was being well used. \"It is absolutely necessary [for the US] to review some of these programmes for much more efficiency and transparency,\" Mr Boulos said. \"We have to make sure the [aid funds] are going to the right place and that we are getting the desired outcome,\" he added. Mr Boulos, whose son is married to Trump's daughter, Tiffany, said several US companies had expressed an interest in exploiting minerals in the Democratic Republic of Congo, following his recent trip to the resource-rich central African nation . DR Congo, home to vast natural reserves like lithium which is essential for battery and electric vehicle production, has been battling Rwandan-backed M23 rebels, who have seized large areas of territory this year. Congolese President Félix Tshisekedi believes US involvement in extracting the minerals could help quell the violence that has plagued the east of the country for nearly 30 years. Currently, DR Congo's mineral wealth is dominated by Chinese firms . Mr Boulos said his country was also interested in exploring minerals in neighbouring Rwanda, but called on the country to first withdraw its troops from DR Congo and stop its support for the M23. Rwanda denies involvement in the conflict. Asked if the US was only interested in benefiting economically from Africa and not its welfare, Boulos said \"our job is to promote the US interests and promote our strategic partnerships\". Trump is also determined \"to end wars and establish peace\" across the world, the envoy said, citing the conflict in Sudan as a big concern for the US government. Mr Boulos, who has served as Washington's senior adviser on Arab and Middle Eastern affairs since December, also visited Kenya, Rwanda and Uganda in his trip. He has business interests in Africa, including in a Nigeria-based company that distributes motor vehicles and equipment in West Africa. The Lebanese-born businessman said Trump felt it was time to end the \"unfair advantage\" taken by other international players of Africa. Responding to reports in the US media that the Trump administration was planning to close most of its diplomatic missions in Africa, Mr Boulos said this was \"not very accurate\", adding: \"Africa is very important to Trump.\" On the trade tariffs announced by Trump, Mr Boulos said they had \"zero net-effect\" for most African countries as they touched on \"small trade volumes\" from the continent. \"Many countries have lined up for negotiations and at the end of the day we want fairness and a win-win solution,\" he added. The small southern African country of Lesotho was hit by the highest of the most recently announced tariffs - 50% - before they were paused for 90 days. It has used the African Growth and Opportunity Act (Agoa) to become a major exporter of textiles, including jeans, to the US. This trade accounts for more than 10% of Lesotho's national income. Agoa was set up by former Us President Bill Clinton in 2000 to encourage trade and investment in Africa but analysts fear that it is unlikely to be renewed by the current, Republican-dominated Congress. You may also be interested in: Unconventional Trump brings openings and perils for Africa Roses, cars and jeans: Has US trade deal helped Africa? Nigeria and Kenya among nations running out of HIV drugs - WHO Race policies or Israel - what's really driving Trump's fury with South Africa? Getty Images/BBC Go to BBCAfrica.com for more news from the African continent. Follow us on Twitter @BBCAfrica , on Facebook at BBC Africa or on Instagram at bbcafrica BBC Africa podcasts Africa Daily Focus on Africa Donald Trump Africa"
  },
  {
    "title": "Judge halts Trump's shutdown of Voice of America",
    "url": "https://www.bbc.com/news/articles/c0jz58zjllzo",
    "snippet": "2 days ago ... Over 1300 VOA employess - including about 1000 journalists - were put on leave following President Donald Trump's executive order.",
    "source": "bbc.com",
    "content": "Judge halts Trump's shutdown of Voice of America 2 days ago Share Save Kayla Epstein BBC News, New York Share Save Getty Images Voice of America signage in Washington, DC. A federal judge has ordered the Trump administration to restore all jobs and funding for the Voice of America and other US-backed news outlets, ruling that efforts to dismantle it violated the law and Constitution. Over 1,300 VOA employees, including about 1,000 journalists, were placed on  leave following President Donald Trump's order. The White House has accused the broadcaster of being \"anti-Trump\" and \"radical\". VOA, still primarily a radio service, was set up during World War II to counter Nazi propaganda, and has become a major global media broadcaster. The ruling noted that because of the cuts, \"VOA is not reporting the news for the first time in its 80-year existence\". Judge Royce Lamberth said the administration acted \"without regard to the harm inflicted on employees, contractors, journalists, and media consumers around the world\". He ordered the administration to take steps to restore employees and contractors to the jobs they had prior to the executive order, and to do the same for Radio Free Asia and the Middle East Broadcasting Networks. The judge found the administration also likely violated the International Broadcasting Act and Congress' power to appropriate funding. \"My colleagues and I are grateful for this ruling. But we know that this is just a small step forward, as the government is likely to appeal,\" said Patsy Widakuswara, the VOA White House bureau chief and a lead plaintiff in the lawsuit. \"We are committed to continuing to fight against what we believe is the administration's unlawful silencing of VOA until we can return to our congressional mandate: to tell America's stories with factual, balanced, and comprehensive,  reporting,\" she said. Trump has long criticised VOA as part of his broader attacks against the media, frequently accusing mainstream outlets of bias. After taking office in January, he appointed a political ally, Kari Lake, to run VOA. Lake has previously supported Trump's false claims that the 2020 election was stolen from him. In March, Trump ordered the US Agency for Global Media (USAGM), which oversees VOA and funds outlets like Radio Free Europe and Radio Free Asia, to be \"eliminated to the maximum extent consistent with applicable law\". A separate judge in New York temporarily blocked the executive order after journalists, advocacy groups and unions sued, arguing the move was unlawful. Judge Lamberth, who is based in Washington, DC, ruled the Trump administration lacked the authority to shutter VOA, which is funded by Congress and has a legislative mandate to deliver credible news globally. \"It is hard to fathom a more straightforward display of arbitrary and capricious actions than the Defendants' actions here,\" he wrote. \"Even though several courts have ruled that the President can remove personnel and terminate grants, a radical district judge is once again attempting to interfere with the Trump Administration's efforts to make the government more efficient,\" White House spokesperson Taylor Rogers said in a statement. USAGM did not immediately respond to a request for comment. Press freedom Donald Trump US politics United States"
  },
  {
    "title": "Revolut: 'I was careful and followed instructions closely, but still lost ...",
    "url": "https://www.bbc.com/news/articles/c93gydxj8n7o",
    "snippet": "4 days ago ... He is wearing a Tzoni Raykov. Tzoni Raykov says Revolut's deposit instructions are not clear enough. Trading cryptocurrency was just a bit of ...",
    "source": "bbc.com",
    "content": "'I was careful and followed instructions closely, but still lost my crypto' 4 days ago Share Save George Sandeman BBC News Share Save Tzoni Raykov Tzoni Raykov says Revolut's deposit instructions are not clear enough Trading cryptocurrency was just a bit of fun for Tzoni Raykov, but losing $1,500 worth to an administrative error has left him with serious concerns about his treatment by the industry. The oil engineer has held an account with Revolut for several years - using its app to split bills with friends after going out for dinner or drinks. They would pay each other using traditional currency, like the pound sterling or US dollar. But after seeing the e-money firm advertise its cryptocurrency services, he decided to give it a try. What Tzoni thought would be a straightforward transfer of cryptocurrency coins has left the Bulgarian national angry and out of pocket. His experience highlights some of the frustrations people have had using cryptocurrency where many of the customer safeguards which underpin standard online banking transactions, some mandated by law, do not apply. \"When they treat you like this, it makes you feel like you can't do anything,\" he told BBC News. \"Like you are powerless.\" What is Bitcoin? Key crypto terms and what they mean What next for Bitcoin after bursting $100k barrier? While the cryptocurrency market is dominated by Bitcoin, there is a plethora of other digital currencies, including USDC - which Tzoni had already amassed in a separate crypto account. His frustrations began in February when he decided to transfer some of his USDC coins to his Revolut account. As a precaution - which Revolut suggests doing - he first sent 10 of the coins, worth $10. It was a success and the funds were credited to his Revolut account. Days later he tried to make a larger transfer of what he thought was 1,500 USDC. The transfer was completed but, this time, the funds were not credited to his account. Tzoni says the problem occurred because Revolut's deposit instructions were unclear. When you transfer cryptocurrency from one account to another, you have to select a network to send it through - like choosing which courier service to use when sending a parcel. Revolut's deposit instructions say to transfer USDC to it, you have to use a network called Polygon. In his first, successful, deposit Tzoni selected one called \"Polygon PoS\". In the second deposit, when he tried to transfer 1,500 USDC, he selected a different network - \"Polygon (bridged)\". He thought it would work just as well but says instead it caused the coins to be converted into USDC.e - a different cryptocurrency. This is what Revolut received. The company does not handle USDC.e coins. Tzoni Raykov Revolut instructs users to make deposits of USDC with them using the Polygon network After seeing his Revolut account had not been credited with the 1,500 coins, Tzoni contacted the Revolut support team. In messages seen by BBC News, they told him the issue seemed to be with \"the specific type of Polygon network used, which led to the conversion\". In another, he was told: \"The app currently specifies 'Polygon' without differentiating between standard and bridged options. I'll note your feedback for future improvements.\" Tzoni thinks if Revolut's deposit instructions had been more specific, his problem would have been avoided. When approached by BBC News about this case, Revolut gave a different answer. The firm said the problem was not because Tzoni had used the wrong Polygon network - which he claimed turned his coins into USDC.e. The deposit failure was \"not because the network itself had 'converted' the token\", it said, without explaining why its support team had suggested to Tzoni that it was. Revolut told us the deposit ultimately failed because the USDC.e coins it received were not supported by the company's technology. It said: \"As is standard industry practice due to the significant technical challenges involved in supporting every combination of token and chain, the recovery of these unsupported assets does not sit within Revolut's scope.\" It means the 1,500 USDC.e coins have not been credited to Tzoni's account or sent back to him. 'They are waiting for me to give up' To Tzoni's mind, this isn't acceptable treatment from a company of Revolut's size and reputation, which handles normal banking deposits as well as cryptocurrency, stocks and commodities. Revolut says it has 10 million users in the UK while last year it was granted a provisional banking licence, paving the way for it to become a fully fledged UK bank. When using a High Street bank, a mistaken transfer of traditional currency would usually be resolved with the money being reverted back to the customer. This was established in 2014 in a voluntary code of practice that most UK banks signed up to. There is no such equivalent in the cryptocurrency industry. After contacting Revolut several times in recent weeks, Tzoni has been told the coins are effectively lost. \"They are waiting for me to get bored and give up, to accept the money is gone. But I won't,\" Tzoni said, pointing out the coins are in the Revolut system. \"It is ridiculous that they can behave like this.\" While Tzoni's loss of cryptocurrency is significant to him, the sum is tiny compared with the size of the industry, which has risen sharply in value over the past 18 months. Reuters Sam Bankman-Fried ran FTX, one of the largest cryptocurrency firms in the world, until it collapsed The global market peaked in value at $3.9tn last December, following the re-election of Donald Trump. Since then it has fallen by $1.1tn, according to tracking website CoinGecko. Government policies in the US and other countries are also changing to favour the cryptocurrency industry, even though it has suffered several scandals. FTX, one of the world's largest cryptocurrency firms, went bankrupt in 2022. Sam Bankman-Fried, its chief executive, was sentenced to 25 years in prison last year for defrauding customers of billions of dollars. Investigators also found FTX was using QuickBooks, a popular accounting software designed for individuals and small businesses, to manage the money. John Ray III, a lawyer tasked with recovering funds from FTX for defrauded customers, told a bankruptcy court: \"Never in my career have I seen such a complete failure of corporate controls and such a complete absence of trustworthy financial information as occurred here.\" He later told a congressional hearing: \"Nothing against QuickBooks. It's a very nice tool, just not for a multibillion-dollar company.\" 'More regulation is needed' A couple of months ago Bybit, the world's second largest cryptocurrency exchange by some estimates, was tricked out of $1.5bn worth of coins by hackers thought to be working for North Korea . The firm had been using Safe, a free digital storage software popular with individuals who want to store cryptocurrency on their own devices, as part of their business operations. Following the theft, Bybit's chief executive said they \"should have upgraded and moved away from Safe\" earlier. One of the problems with cryptocurrency firms, says Prof Mark Button, who researches cybercrime, is they can grow very quickly, which means they don't always keep up with the accounting and security challenges of managing so much money. \"For me it illustrates that if we are going to be serious about cryptocurrencies in the future… there needs to be some kind of regulation.\" In Tzoni's case, it might have been easier for him to get his cryptocurrency back or be compensated if there were laws stating what firms need to do if they are sent a coin they don't handle. Higher industry standards might also have prevented him making such a transaction in the first place. Mykhailo Tiutin is chief technology officer at AMLBot, a company that analyses how risky cryptocurrency transactions are. Their service runs checks similar to those supported by banks, where details for a transfer, such as the account holder's name, sort code and account number, are verified. He says cryptocurrency is safe enough for the average person to use but that they should be careful about which products and services they choose. He says he has also lost cryptocurrency after making an administrative mistake. \"You have to do your own research,\" he told us. \"The successes and the losses are ultimately at your own risk.\" More on this story ‘I lost £165k to fraud in an hour’ - customers say they were let down by Revolut North Korean hackers cash out hundreds of millions from $1.5bn ByBit hack Crypto giant FTX collapses into bankruptcy Banking Cryptocurrency Customer service"
  },
  {
    "title": "Lomond boarding school to accept tuition fee payments in Bitcoin",
    "url": "https://www.bbc.com/news/articles/c5yg9p589vro",
    "snippet": "Apr 12, 2025 ... A Scottish boarding school has announced it will accept payments of school fees in the cryptocurrency Bitcoin. Lomond School in Helensburgh, Argyll and Bute ...",
    "source": "bbc.com",
    "content": "Scottish boarding school to accept fees in Bitcoin 12 April 2025 Share Save Paul O'Hare BBC Scotland News Share Save Lomond School Lomond School in Helensburgh accepts pupils from nursery to 18 years old A Scottish boarding school has announced it will accept payments of school fees in the cryptocurrency Bitcoin. Lomond School in Helensburgh, Argyll and Bute - which charges up to £38,000 per year - said the move came after requests from some parents. Tuition payments will be accepted in Bitcoin from autumn term this year, but these will initially be converted to UK pounds to \"mitigate currency risk\". The school said adopting Bitcoin aligned with its \"ethos of independent thinking and innovation\". No other cryptocurrencies will be accepted. Lomond School claims to be the first private school in the UK to accept cryptocurrency fee payments. More stories from Glasgow & West Scotland More stories from Scotland Head teacher Claire Chisholm said: \"For generations, this school has nurtured inquirers, thinkers, communicators, and open-minded risk-takers. \"It's really no surprise then that the inventor of the television, John Logie Baird, is a former pupil.\" Lomond was founded in Helenburgh in 1977 in a merger between the historic Larchfield School and St Bride's School for Girls. It accepts pupils from nursery at age three until 18 years old. The school said every Bitcoin transaction would be \"secure, transparent, and lawful\". It said these would meet UK financial regulations, including anti-money laundering and tax compliance. Bitcoin is a type of digital currency that is not controlled by centralised financial institutions . Its price climbed in value in 2024, but it is extremely volatile and can rise and fall in value at the whim of buyers and sellers. Crypto prices rally after Trump backs five coins for 'crypto reserve' Bitcoin in the bush - the crypto mine in remote Zambia What is Bitcoin? Key crypto terms and what they mean Bitcoin Helensburgh Scotland Education Private schools"
  },
  {
    "title": "Bitcoin - BBC News",
    "url": "https://www.bbc.com/news/topics/c734j90em14t",
    "snippet": "Apr 12, 2025 ... Trump named five cryptocurrencies he wanted in a potential national reserve so the US could become the Crypto Capital of the World.",
    "source": "bbc.com",
    "content": "Bitcoin 12 Apr 2025 Scottish boarding school to accept fees in Bitcoin Lomond School in Helensburgh which charges up to £38,000 per year said the move came after requests from parents. 12 Apr 2025 Scotland 4 Apr 2025 How crypto mines are boosting electricity in rural Africa 4 Apr 2025 31 Mar 2025 Football club owner expands his hometown investment Peter McCormack says if more people come into town to spend money he will open more businesses. 31 Mar 2025 Beds, Herts & Bucks 25 Mar 2025 Bitcoin in the bush - the crypto mine in remote Zambia Bitcoin miners will go to remote locations to take advantage of cheap electricity. 25 Mar 2025 Africa 13 Mar 2025 NCA officer charged over theft of £60k of Bitcoin Paul Chowles, from Bristol, is alleged to have stolen £60,000 worth of the cryptocurrency Bitcoin. 13 Mar 2025 England 7 Mar 2025 'A pig in lipstick': Trump's strategic Bitcoin reserve criticised The reserve will hold cryptocurrency forfeited to the government in criminal or civil proceedings, said the White House. 7 Mar 2025 Business 2 Mar 2025 Crypto prices rally after Trump backs five coins for 'crypto reserve' Trump named five cryptocurrencies he wanted in a potential national reserve so the US could become \"the Crypto Capital of the World\". 2 Mar 2025 US & Canada 21 Feb 2025 Cryptocurrency twins finalise football investment The billionaires are to become co-owners of eighth-tier club Real Bedford FC. 21 Feb 2025 Beds, Herts & Bucks 16 Feb 2025 'This battle is my 9 to 5 - I won't stop until I have my £620m of Bitcoin back' James Howells claimed his ex-girlfriend threw out the hard drive, today worth £620m, in 2013. 16 Feb 2025 Wales ..."
  },
  {
    "title": "Trump crypto soars as US president offers dinner to top holders",
    "url": "https://www.bbc.com/news/articles/ce8g2kpzx0go",
    "snippet": "11 hours ago ... The meme coin's website says its 220 top investors will be invited to a gala event with the president.",
    "source": "bbc.com",
    "content": "Trump crypto soars as president offers dinner to top holders 11 hours ago Share Save João da Silva Business reporter, BBC News Share Save Getty Images The meme coin is one of several crypto-related ventures launched by businesses linked to Trump The price of Donald Trump's cryptocurrency has soared after the US president promised to host two special events for its top investors. The website for the $Trump meme coin says its 220 biggest holders will be invited to a private gala dinner with the president on 22 May, describing it as the \"most EXCLUSIVE INVITATION in the world.\" According to crypto trading platform Coinbase, $Trump jumped by more than 70% after the announcement. But it remains well below the record high of more than $74 (£42.40) reached shortly after its launch in January. The digital currency is one of several crypto-related ventures launched by businesses linked to Trump, who has called himself the \"crypto president\". As well as the gala dinner, which will be held at the Trump National Golf Club in Washington DC, there will be \"an ultra-exclusive private VIP reception with the President\" for the top 25 coin holders, the coin's website said. Trump tokens in circulation are currently worth a total of around $2.5bn. They were first released just days before his inauguration on 20 January. The move was criticised by several people in the crypto industry , with some calling it \"a stunt\". Fight Fight Fight LLC The invitation on the meme coin's website First lady Melania Trump also launched a cryptocurrency on the eve of the inauguration. Meme coins are often used by speculators to make money or to allow fans to show support to a celebrity or moment in internet culture. Shortly after returning to the White House this year, Trump signed an executive order to create a presidential working group tasked with proposing new crypto laws and regulations. He has also signed an order to create a Strategic Bitcoin Reserve as well as a Digital Asset Stockpile, which will include other digital currencies. Those funds will be stocked with coins forfeited to the federal government as part of criminal or civil proceedings. This week, Trump's media company announced plans to launch exchange traded-funds (ETFs). The financial products to be launched by Trump Media & Technology Group, owner of the Truth Social platform, and its partners will include digital assets as well as stocks with a \"Made in America focus\". ETFs are investment funds that hold multiple assets. They can be bought and sold in a similar way to shares. International Business Donald Trump Cryptocurrency"
  },
  {
    "title": "The bitcoin miners in rural Zambia",
    "url": "https://www.bbc.com/reel/video/p0l3kppx/the-bitcoin-miners-in-rural-zambia",
    "snippet": "Apr 11, 2025 ... The bitcoin miners in rural Zambia. Tech Now reporter Joe Tidy visits the Zengamina Mini Hydro Plant in Zambia, run by a cryptocurrency company who is planning ...",
    "source": "bbc.com",
    "content": "The bitcoin miners in rural Zambia Tech Now reporter Joe Tidy visits the Zengamina Mini Hydro Plant in Zambia, run by a cryptocurrency company who is planning to roll out mini-power plants to rural villages in Zambia and across Africa. The goal is to bring electricity to remote areas for villagers. This video is from Tech Now, the BBC's flagship technology programme. 11 April 2025 Tech Now Share Save Watch rare Gobi bear's reaction to finding water So rare they were thought to be a myth and undertake arduous journeys of up to 100 miles to find water. 1 day ago Natural wonders The spectacle of a great Pelican feeding bonanza The dam at Marsh Lake, Minnesota, has created an unexpected opportunity for pelicans. 2 days ago Natural wonders The ancient history of Iceland's warring Viking families The Travel Show visits an immersive experience that brings to life a brutal battle between Iceland's Vikings. 3 days ago Adventures Yannick Nézet-Séguin: From child podigy to modern maestro The renowned conductor and music director of the Met Opera reveals how a calling became his lifelong journey. 3 days ago Arts in Motion Explore the tiny biodegradable pacemaker for newborns Researchers have created a pacemaker smaller than a grain of rice that does not require open surgery to implant. 6 days ago Innovation Why you might be younger than you think you are There is a difference between our chronological and biological age, which we have the power to control. 8 days ago Health Decoded Malaysian trade minister on US tariffs Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US. 8 days ago World of Business Ten striking images of an Earth scarred by humans From a shipwrecking yard in Bangladesh to a river of iron dioxide in Canada, a deep dive in Ed Burtynsky's work. 16 Apr 2025 Earth Up-close with giant river otters as they learn how to fish It takes three years for an otter cub to master the complexities of a successful hunt. 15 Apr 2025 World of wonder A historic look at the iconic VW campervan The Travel Show sets off on a journey to celebrate an instantly recognisable travel icon, the VW campervan. 14 Apr 2025 Adventures Week in Markets - 11 Apr 2025 A weekly summary of the big stories from financial markets around the world. 11 Apr 2025 World of Business Inside one of the world's most remote restaurants 'Off-Map Destination' winner Wolfgat offers a menu made from hyper-local and foraged ingredients. 11 Apr 2025 World's Table 'Economic uncertainty will lower investment' - 11 Apr 2025 Tech sector venture capitalist says the global economic uncertainty will mean less investment for private equity. 11 Apr 2025 Opening Bell 'One to one' with John Lennon and Yoko Ono BBC's Tom Brook explores never-before-seen footage and shares his personal connection with the new documentary. 10 Apr 2025 Film & TV What's inside a black hole? Black holes are one of the mysteries of the universe where all the laws of nature as we know them stop working. 9 Apr 2025 Science Inside the world of weaverbirds' stunning nest creation Watch as weaverbirds build intricate nests along the Blue Nile to attract a mate. 8 Apr 2025 World of wonder It's Microsoft's 50th birthday - what comes next? It's Microsoft's 50th anniversary and BBC technology editor Zoe Kleinman tours its Redmond headuarters. 8 Apr 2025 World of Business A lot of questions over trade negotiations - 8 Apr 2025 Expert says it is unclear whether there is room for tariff negotiation between the US and other countries. 8 Apr 2025 Opening Bell 'Keep going, keep going, keep going' Dancer and choreographer Lee Serle talks about embracing uncertainty and never stopping, no matter the setbacks. 7 Apr 2025 Arts in Motion Spain ‘social emergency’ as rents double in a decade This is despite the fact that its economy has been performing well in other areas. 7 Apr 2025 World of Business"
  },
  {
    "title": "Minister Lucy Powell's X account hacked to promote crypto scam",
    "url": "https://www.bbc.com/news/articles/cr5drp0n8zjo",
    "snippet": "Apr 15, 2025 ... Taking over X accounts to advertise scam crypto coins is a common method used by cyber criminals. Fraudsters often take over accounts using phishing emails - ...",
    "source": "bbc.com",
    "content": "Minister's X account hacked to promote crypto scam 15 April 2025 Share Save Becky Morton Political reporter Share Save Rex/Shutterstock Government minister Lucy Powell's X account has been hacked to promote a scam \"House of Commons\" cryptocurrency. A string of now deleted posts on the House of Commons leader's account described the \"$HCC\" coin as \"a community-driven digital currency bringing people's power to the blockchain\". The MP's office confirmed her account was hacked on Tuesday morning and said \"steps were taken quickly to secure the account and remove misleading posts\". Other public figures with a large number of followers who have been targeted in a similar way by online hackers recently include BBC journalist Nick Robinson. Some of the posts from Powell's account, which is verified by the platform and mentions her cabinet position in the bio, included an image of the House of Commons logo. The MP for Manchester Central, who has nearly 70,000 followers on X, has been leader of the House of Commons since Labour won power last summer. The role is responsible for planning and supervising the government's legislative programme, while also upholding the rights of backbench MPs. X A screengrab of one of the posts on Powell's account, which was quickly deleted Taking over X accounts to advertise scam crypto coins is a common method used by cyber criminals. Fraudsters often take over accounts using phishing emails - scam emails containing links to websites that either access systems or trick users into sharing their passwords. Passwords can also be obtained using leaked information from data breaches. At that point cyber criminals take over the account and plan their posts around hastily spun up crypto coins that can only take a couple of hours to create and launch. They hope that high-profile and trusted accounts might encourage people to buy some of the otherwise worthless coins so that they can make some money before it all get blocked and stopped. Luke Nolan, a senior research associate at CoinShares, an asset management company specialising in digital assets, said the hack of Powell's account was an example of \"pump and dump\". This is when the people who created the cryptocoin inflate its value, get others to invest, and then sell their majority share to get profit, but leave the coin worthless. Mr Nolan said there had only been 34 transactions on the coin, which would have led to a profit of about £225. A House of Commons spokesman said: \"UK Parliament takes cyber security extremely seriously. \"We provide advice to users - including Members - to make them aware of the risks and how to manage their digital safety; however, we do not comment on specific details of our cyber security policies.\" Action Fraud said there was a rise in social and email accounts being hacked in 2024, with 35,343 reports. It advises setting up 2-step verification for accounts and using a strong, unique password of three random words. Earlier this year Robinson, who presents BBC Radio 4's Today programme, said his X account was hacked after he clicked on an email he wrongly believed was sent to him by the social media platform. Post on his account claimed he was launching a cryptocurrency called \"$Today\". Nick Robinson's X account hacked to promote crypto Major US Twitter accounts hacked in Bitcoin scam Sign up for our Politics Essential newsletter to keep up with the inner workings of Westminster and beyond. Lucy Powell Cryptocurrency"
  },
  {
    "title": "Cryptocurrency - BBC News",
    "url": "https://www.bbc.com/news/topics/cyd7z4rvdm3t",
    "snippet": "Apr 15, 2025 ... North Korean hackers cash out hundreds of millions from $1.5bn ByBit hack. Hackers from the infamous Lazarus Group are in a cat-and-mouse game to launder their ...",
    "source": "bbc.com",
    "content": "Cryptocurrency 11 hrs ago Trump crypto soars as president offers dinner to top holders The meme coin's website says its 220 top investors will be invited to a gala event with the president. 11 hrs ago Business 4 days ago 'I was careful and followed instructions closely, but still lost my crypto' A customer's experience highlights issues dealing with cryptocurrency, where many regular banking safeguards do not apply. 4 days ago 15 Apr 2025 Minister's X account hacked to promote crypto scam The MP's office says \"steps were taken quickly to secure the account and remove misleading posts\". 15 Apr 2025 Politics 12 Apr 2025 Investment fraud cost county £5m in 2024 - police Figures from Action Fraud shows cryptocurrency fraud is on the rise, a police force says. 12 Apr 2025 Suffolk 4 Apr 2025 How crypto mines are boosting electricity in rural Africa 4 Apr 2025 25 Mar 2025 Bitcoin in the bush - the crypto mine in remote Zambia Bitcoin miners will go to remote locations to take advantage of cheap electricity. 25 Mar 2025 Africa 13 Mar 2025 India arrests crypto administrator with Russia links wanted by US Aleksej Besciokov is wanted by the US for allegedly laundering money and violating sanctions. 13 Mar 2025 World 11 Mar 2025 How North Korean hackers pulled off biggest ever crypto heist 11 Mar 2025 10 Mar 2025 North Korean hackers cash out hundreds of millions from $1.5bn ByBit hack Hackers from the infamous Lazarus Group are in a cat-and-mouse game to launder their stolen funds from the ByBit heist. 10 Mar 2025 Technology ..."
  },
  {
    "title": "The tech that can help you pick better perfumes",
    "url": "https://www.bbc.com/reel/video/p0l4ktgg/the-tech-that-can-help-you-pick-better-perfumes",
    "snippet": "7 hours ago ... Choosing a perfume can be overwhelming, but could technology help us to make better choices? Tech Now reporter Laura Goodwin takes us into the world of AI ...",
    "source": "bbc.com",
    "content": "The tech that can help you pick better perfumes Choosing a perfume can be overwhelming, but could technology help us to make better choices? Tech Now reporter Laura Goodwin takes us into the world of AI scents. This video is from Tech Now, the BBC’s flagship technology programme. 7 hours ago Tech Now Share Save Watch rare Gobi bear's reaction to finding water So rare they were thought to be a myth and undertake arduous journeys of up to 100 miles to find water. 1 day ago Natural wonders The spectacle of a great Pelican feeding bonanza The dam at Marsh Lake, Minnesota, has created an unexpected opportunity for pelicans. 2 days ago Natural wonders The ancient history of Iceland's warring Viking families The Travel Show visits an immersive experience that brings to life a brutal battle between Iceland's Vikings. 3 days ago Adventures Yannick Nézet-Séguin: From child podigy to modern maestro The renowned conductor and music director of the Met Opera reveals how a calling became his lifelong journey. 3 days ago Arts in Motion Explore the tiny biodegradable pacemaker for newborns Researchers have created a pacemaker smaller than a grain of rice that does not require open surgery to implant. 6 days ago Innovation Why you might be younger than you think you are There is a difference between our chronological and biological age, which we have the power to control. 8 days ago Health Decoded Malaysian trade minister on US tariffs Malaysia's minister Zafrul Aziz will be representing the ASEAN bloc in its negotiations with the US. 8 days ago World of Business Ten striking images of an Earth scarred by humans From a shipwrecking yard in Bangladesh to a river of iron dioxide in Canada, a deep dive in Ed Burtynsky's work. 16 Apr 2025 Earth Up-close with giant river otters as they learn how to fish It takes three years for an otter cub to master the complexities of a successful hunt. 15 Apr 2025 World of wonder A historic look at the iconic VW campervan The Travel Show sets off on a journey to celebrate an instantly recognisable travel icon, the VW campervan. 14 Apr 2025 Adventures Week in Markets - 11 Apr 2025 A weekly summary of the big stories from financial markets around the world. 11 Apr 2025 World of Business Inside one of the world's most remote restaurants 'Off-Map Destination' winner Wolfgat offers a menu made from hyper-local and foraged ingredients. 11 Apr 2025 World's Table 'Economic uncertainty will lower investment' - 11 Apr 2025 Tech sector venture capitalist says the global economic uncertainty will mean less investment for private equity. 11 Apr 2025 Opening Bell 'One to one' with John Lennon and Yoko Ono BBC's Tom Brook explores never-before-seen footage and shares his personal connection with the new documentary. 10 Apr 2025 Film & TV What's inside a black hole? Black holes are one of the mysteries of the universe where all the laws of nature as we know them stop working. 9 Apr 2025 Science Inside the world of weaverbirds' stunning nest creation Watch as weaverbirds build intricate nests along the Blue Nile to attract a mate. 8 Apr 2025 World of wonder It's Microsoft's 50th birthday - what comes next? It's Microsoft's 50th anniversary and BBC technology editor Zoe Kleinman tours its Redmond headuarters. 8 Apr 2025 World of Business A lot of questions over trade negotiations - 8 Apr 2025 Expert says it is unclear whether there is room for tariff negotiation between the US and other countries. 8 Apr 2025 Opening Bell 'Keep going, keep going, keep going' Dancer and choreographer Lee Serle talks about embracing uncertainty and never stopping, no matter the setbacks. 7 Apr 2025 Arts in Motion Spain ‘social emergency’ as rents double in a decade This is despite the fact that its economy has been performing well in other areas. 7 Apr 2025 World of Business"
  },
  {
    "title": "Technology of Business | Latest News & Updates | BBC News",
    "url": "https://www.bbc.com/business/technology-of-business",
    "snippet": "Apr 14, 2025 ... Bitcoin miners will go to remote locations to take advantage of cheap electricity. 24 Mar 2025. Africa · The slow but steady advance of driverless ...",
    "source": "bbc.com",
    "content": "Technology of Business Do we need cocoa-free chocolate and is it nice? Cocoa prices are soaring so new chocolate firms are looking at an alternative ingredient. 10 Apr 2025 A revolution is under way in India's trainer industry India wants to boost the domestic trainer industry but will small domestic makers suffer? 8 Apr 2025 Asia What's next for social media? Start-up social media firms are looking to capitalise on dissatisfaction with the social media giants. 28 Mar 2025 Bitcoin in the bush - the crypto mine in remote Zambia Bitcoin miners will go to remote locations to take advantage of cheap electricity. 25 Mar 2025 Africa The slow but steady advance of driverless vehicles Robo-taxi services and driverless trucks are gaining ground but progress is painstaking. 21 Mar 2025 A revolution is under way in India's trainer industry India wants to boost the domestic trainer industry but will small domestic makers suffer? 8 Apr 2025 Asia What is live shopping and will it take off? Big in Asia, live shopping involves brands putting on live shows to sell direct to shoppers. 3 Apr 2025 The Finnish defence firms 'on steroids' Helsinki has become one of the top five cities in Europe for investment in defence and security technologies. 31 Mar 2025 What's next for social media? Start-up social media firms are looking to capitalise on dissatisfaction with the social media giants. 28 Mar 2025 Subsea fibre cables can 'listen out' for sabotage Ways are being developed for subsea cables to \"sense\" whether they are being disturbed or attacked. 18 Mar 2025 Technology Car sharing switches to electric to boost appeal Car sharing has not taken off, but will electric cars boost its appeal? 14 Mar 2025 Why people are cutting back their online profile A new wave of AI has spurred some to think more carefully about their online presence. 11 Mar 2025 Deep-sea mining tech advances but doubts remain Despite opposition investors are still looking at deep-sea mining technology. 7 Mar 2025 Why detecting methane is difficult but crucial work From handheld to space-based, new methane detectors are making it easier to track the greenhouse gas. 4 Mar 2025 Can AI help modernise Ireland's healthcare system? Ireland is investing billions of euros to revamp its healthcare service - will AI help? 28 Feb 2025 Europe Countries compete to keep skilled young workers EU nations hope that tax benefits might encourage young, skilled workers to stay, but will they work? 25 Feb 2025 Europe Hair: 'It’s just thrown away but it's gold' India is the world's biggest exporter of human hair but it wants more of the lucrative wig market. 17 Feb 2025 Scientists work on 'superhuman' vision systems for robots Researchers have given a robot a powerful radio-based vision system which can see through smoke. 14 Feb 2025 Why do kindness influencers get criticised? Kindness influencers give away money and gifts but not everyone supports their work. 11 Feb 2025 Latest updates 14 Apr 2025 Finland's bid to win Europe's start-up crown Helsinki wants to become a top European start-up hub, but can it challenge London and Stockholm? 14 Apr 2025 10 Apr 2025 Do we need cocoa-free chocolate and is it nice? Cocoa prices are soaring so new chocolate firms are looking at an alternative ingredient. 10 Apr 2025 8 Apr 2025 A revolution is under way in India's trainer industry India wants to boost the domestic trainer industry but will small domestic makers suffer? 8 Apr 2025 Asia 3 Apr 2025 What is live shopping and will it take off? Big in Asia, live shopping involves brands putting on live shows to sell direct to shoppers. 3 Apr 2025 31 Mar 2025 The Finnish defence firms 'on steroids' Helsinki has become one of the top five cities in Europe for investment in defence and security technologies. 31 Mar 2025 28 Mar 2025 What's next for social media? Start-up social media firms are looking to capitalise on dissatisfaction with the social media giants. 28 Mar 2025 21 Mar 2025 The slow but steady advance of driverless vehicles Robo-taxi services and driverless trucks are gaining ground but progress is painstaking. 21 Mar 2025 18 Mar 2025 Subsea fibre cables can 'listen out' for sabotage Ways are being developed for subsea cables to \"sense\" whether they are being disturbed or attacked. 18 Mar 2025 Technology 18 Mar 2025 Disasters spur investment in flood and fire risk tech Services that assess climate change risks are springing up for home buyers, insurers and lenders. 18 Mar 2025 ..."
  },
  {
    "title": "BBC",
    "url": "https://www.bbc.com/reel/topic/tech-now",
    "snippet": "Apr 11, 2025 ... The bitcoin miners in rural Zambia ... Tech Now visits Zambia to see how Bitcoin is helping to provide villagers with electricity. ... Electric Flight: Will It Take ...",
    "source": "bbc.com",
    "content": "Tech Now 7 hrs ago The tech that can help you pick better perfumes Can AI help this BBC reporter simplify her perfume choices? 7 hrs ago Tech Now 11 Apr 2025 The bitcoin miners in rural Zambia Tech Now visits Zambia to see how Bitcoin is helping to provide villagers with electricity. 11 Apr 2025 Tech Now 4 Apr 2025 Will electric flight take off? The Tech Now team take to the skies in Sweden to explore developments in electric flight to clean up air travel. 4 Apr 2025 Tech Now"
  }
]